<a href="https://colab.research.google.com/github/mkbahk/PandasLearning/blob/main/_Pandas_%ED%95%9C%EB%B2%88%EC%97%90_%EC%A0%9C%EB%8C%80%EB%A1%9C_%EB%B0%B0%EC%9A%B0%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas 한번에 제대로 배우기



---

#Pandas란?
관계 또는 레이블링 데이터로 쉽게 직관적으로 작업할 수 있도록 고안된 빠르고, 유연하며 표현력이 뛰어난 데이터 구조를 제공하는 Python 패키지

# Pandas의 특징
* 부동 소수점이 아닌 데이타뿐만 아니라 부동 소수점 데이터에서도 결측 데이터(NaN으로 표시됨)를 쉽게 처리
* 크기 변이성(Size mutability): DataFrame 및 고차원 객체에서 열을 삽입 및 삭제가능
* 자동 및 명시적(explicit) 데이터 정렬: 객체를 라벨 집합에 명시적으로 정렬하거나, 사용자가 라벨을 무시하고 Series, DataFrame등의 계산에서 자동적으로 데이타 조정 가능
* 데이타 세트에서 집계 및 변환을 위한 분할(split), 적용(apply), 결합(combine)작업을 수행할 수 있는 강력하고 유연한 group-by 함수 제공
* 누락된 데이타 또는 다른 Python 및 Numpy 데이타 구조에서 서로 다른 인텍싱 데이터를 DataFrame개체로 쉽게 변환
* 대용량 데이타 세트의 지능형 라벨기반 슬라이싱, 고급 인텍싱 및 부분 집합 구하기 가능
* 직관적인 데이타 세트 병합 및 결함
* 데이타 세트의 유연한 재구성 및 피벗
* 축의 계층적 라벨링(눈금당 여러 개의 라벨을 가질 수 있음)
* 플렛 파일(CSV 및 구분), Excel파일, 데이타베이스 로딩 및 초고속 HDF5 형식의 데이타저장/로드에 사용되는 강력한 IO도구
* 시계열 특정 기능: 날짜 범위 생성 및 주파수 변환, 무빙 윈도우(Moving window) 통계, 날짜 이동 및 지연

In [3]:
import numpy as np
import pandas as pd #pandas는 numpy 기반으로 작성됨, 그래서 먼저 numpy loading필요
print(np.__version__)
print(pd.__version__)

1.19.5
1.1.5

## Pandas 객체

### Series 객체

In [ ]:
s = pd.Series([0, 0.25, 0.5, 0.75, 1.0])
s #index가 함께 저장된

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [ ]:
s.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [ ]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
s[1]

0.25

In [ ]:
s[1:4]

1    0.25
2    0.50
3    0.75
dtype: float64

In [ ]:
s = pd.Series([0.0, 0.25, 0.5, 0.75, 1.0],
              index=['a', 'b', 'c', 'd', 'e'])
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [ ]:
s['c']

0.5

In [ ]:
s[['c', 'd', 'e']]

c    0.50
d    0.75
e    1.00
dtype: float64

In [ ]:
'b' in s

True

In [ ]:
s = pd.Series([0.0, 0.25, 0.5, 0.75, 1.0],
              index=[2, 4, 6, 8, 10])
s

2     0.00
4     0.25
6     0.50
8     0.75
10    1.00
dtype: float64

In [ ]:
s[4]

0.25

In [ ]:
s[2:]

6     0.50
8     0.75
10    1.00
dtype: float64

In [ ]:
s.unique()

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [ ]:
s.value_counts()

1.00    1
0.75    1
0.50    1
0.25    1
0.00    1
dtype: int64

In [ ]:
s.isin([0.25, 0.75])

2     False
4      True
6     False
8      True
10    False
dtype: bool

In [ ]:
pop_tuple ={"서울특별시": 9720645,
            "부산광역시": 3404423,
            "대구광역시": 2427954,
            "인천광역시": 2947217,
            "대전광역시": 1471040,
            "광주광역시": 1455048}
population = pd.Series(pop_tuple)
population

서울특별시    9720645
부산광역시    3404423
대구광역시    2427954
인천광역시    2947217
대전광역시    1471040
광주광역시    1455048
dtype: int64

In [ ]:
population['서울특별시']

9720645

In [ ]:
population['서울특별시':'인천광역시'] #슬라이싱

서울특별시    9720645
부산광역시    3404423
대구광역시    2427954
인천광역시    2947217
dtype: int64

### DataFrame 객체
* 여러 컬럼이 들어간 객체형태로 만드는 것이 가능

In [ ]:
pd.DataFrame([{'A':2, 'B':4, 'D':3}, 
              {'A':4, 'B':5, 'C':7}]) #2차원형태로, Missing Valule 처리가 뛰어남

   A  B    D    C
0  2  4  3.0  NaN
1  4  5  NaN  7.0

In [ ]:
pd.DataFrame(np.random.rand(5, 5),  #randint 아님 
             columns=['A', 'B', 'C', 'D', 'E'],
             index=[1, 2, 3, 4, 5])

          A         B         C         D         E
1  0.185313  0.763309  0.308573  0.684818  0.070459
2  0.280880  0.484197  0.573261  0.570421  0.425205
3  0.834974  0.345010  0.159011  0.727585  0.692102
4  0.136138  0.992849  0.948944  0.655484  0.654082
5  0.103116  0.536371  0.176305  0.349696  0.081829

In [ ]:
male_tuple = {"서울특별시": 4732275,
            "부산광역시": 1668618,
            "대구광역시": 1476813,
            "인천광역시": 1198815,
            "대전광역시": 734441,
            "광주광역시": 720060}

male = pd.Series(male_tuple)
male

서울특별시    4732275
부산광역시    1668618
대구광역시    1476813
인천광역시    1198815
대전광역시     734441
광주광역시     720060
dtype: int64

In [ ]:
female_tuple = {"서울특별시": 4988571,
            "부산광역시": 1735805,
            "대구광역시": 1470404,
            "인천광역시": 1229139,
            "대전광역시": 736599,
            "광주광역시": 734988}

female = pd.Series(female_tuple)
female

서울특별시    4988571
부산광역시    1735805
대구광역시    1470404
인천광역시    1229139
대전광역시     736599
광주광역시     734988
dtype: int64

In [ ]:
korea_df = pd.DataFrame({'전체인구수': population,
                        '남자인구수': male,
                        '여자인구수': female})  # RDB Join 기능이 아주 쉽게 완성됨
korea_df

         전체인구수    남자인구수    여자인구수
서울특별시  9720645  4732275  4988571
부산광역시  3404423  1668618  1735805
대구광역시  2427954  1476813  1470404
인천광역시  2947217  1198815  1229139
대전광역시  1471040   734441   736599
광주광역시  1455048   720060   734988

In [ ]:
korea_df.index

Index(['서울특별시', '부산광역시', '대구광역시', '인천광역시', '대전광역시', '광주광역시'], dtype='object')

In [ ]:
korea_df.columns

Index(['전체인구수', '남자인구수', '여자인구수'], dtype='object')

In [ ]:
korea_df['여자인구수'] #RDB Select

서울특별시    4988571
부산광역시    1735805
대구광역시    1470404
인천광역시    1229139
대전광역시     736599
광주광역시     734988
Name: 여자인구수, dtype: int64

In [ ]:
korea_df['서울특별시':'인천광역시'] #슬라이스 == RDB Select

         전체인구수    남자인구수    여자인구수
서울특별시  9720645  4732275  4988571
부산광역시  3404423  1668618  1735805
대구광역시  2427954  1476813  1470404
인천광역시  2947217  1198815  1229139

### Index 객체

|클래스|설명|
|---|---|
|Index| 일반적인 Index 객체이며, NumPy배열 형식으로 축의 이름 표현|
|Int64Index|정수 값을 위한 Index|
|MultiIndex|단일 축에 여러 단계 색인을 표현하는 계층적 Index객체(튜플의 배열과 유사|
|DatetimeIndex| NumPy의 datetime64 타입으로 타임스템프 저장|
|PeriodIndex| 기간 데이타를 위한 Index|

In [ ]:
idx = pd.Index([2, 4, 6, 8, 10])
idx

Int64Index([2, 4, 6, 8, 10], dtype='int64')

In [ ]:
idx[1]

4

In [ ]:
idx[1:2:2]

Int64Index([4], dtype='int64')

In [ ]:
idx[-1::]

Int64Index([10], dtype='int64')

In [ ]:
idx[::2] #step을 띄움

Int64Index([2, 6, 10], dtype='int64')

In [ ]:
print(idx)
print(idx.size)
print(idx.shape)
print(idx.ndim)
print(idx.dtype)

Int64Index([2, 4, 6, 8, 10], dtype='int64')
5
(5,)
1
int64

#### Index 연산
|연산자|메소드|설명|
|---|---|---|
||```append```|색인 객체를 추가해 새로운 색인 반환|
||```difference```|색인의 차집합 반환|
|```&```|```intersection```|색인의 교집합 반환|
|```\|```|```union```|색인의 합집합 반환|
| |```isin```|색인이 존재하는지 여부를 불리언 배열로 반환|
| |```delete```|색인이 삭제된 새로운 색인 반환|
| |```drop```|값이 삭제된 새로운 색인 반환|
| |```insert```|색인이 추가된 새로운 색인반환|
| |```is_monotonic```|색인이 단조성을 가지면 True|
| |```is_unique```|중복되는 색인이 없다면 True|
| |```unique```|색인에서 중복되는 요소를 제거하고 유일한 값만 반환|
|```^```|``` ```|여집합, 공통적인 것을 뺀 나머지|

In [ ]:
idx1 = pd.Index([1, 2, 4, 6, 8])
idx2 = pd.Index([2, 4, 5, 6, 7])
print(idx1.append(idx2))
print(idx1 + idx2)

print(idx1.difference(idx2)) #idx2에 없는 것만 
print(idx1 - idx2)

print(idx1.intersection(idx2)) #공통되는 부분만
print(idx1 & idx2)

print(idx1.union(idx2)) #합집합인데 중복을 제거함
print(idx1 | idx2)

print(idx1.delete(0)) #첫번째 1값이 빠짐
print(idx1)
print(idx1.drop(1))
print(idx1)

print(idx1 ^ idx2) #여집합, 공통적인 것을 뺀 나머지

Int64Index([1, 2, 4, 6, 8, 2, 4, 5, 6, 7], dtype='int64')
Int64Index([3, 6, 9, 12, 15], dtype='int64')
Int64Index([1, 8], dtype='int64')
Int64Index([-1, -2, -1, 0, 1], dtype='int64')
Int64Index([2, 4, 6], dtype='int64')
Int64Index([2, 4, 6], dtype='int64')
Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')
Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')
Int64Index([2, 4, 6, 8], dtype='int64')
Int64Index([1, 2, 4, 6, 8], dtype='int64')
Int64Index([2, 4, 6, 8], dtype='int64')
Int64Index([1, 2, 4, 6, 8], dtype='int64')
Int64Index([1, 5, 7, 8], dtype='int64')



---

## 인덱싱(Indexing)

In [ ]:
s = pd.Series([0.0, 0.25, 0.5, 0.75, 1.0],
              index=['a', 'b', 'c', 'd', 'e'])
print(s)

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [ ]:
print(s['b'])

0.25

In [ ]:
print('b' in s)

True

In [ ]:
print(s.keys())

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [ ]:
print(s.items()) #묶여서 있어서
print(list(s.items())) #list로 한번 감싸주어야 함

<zip object at 0x7f4a7727a820>
[('a', 0.0), ('b', 0.25), ('c', 0.5), ('d', 0.75), ('e', 1.0)]

In [ ]:
s['f'] = 1.25 #값을 추가할 수 있다.
print(s)

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
f    1.25
dtype: float64

In [ ]:
print(s['a': 'd'])
print(s[0:4]) #숫자로 슬라이싱 가능

a    0.00
b    0.25
c    0.50
d    0.75
dtype: float64
a    0.00
b    0.25
c    0.50
d    0.75
dtype: float64

In [ ]:
s[(s > 0.4) & (s < 0.8)] #위 조건에 해당하는 것만 출력

c    0.50
d    0.75
dtype: float64

In [ ]:
s[['a', 'c', 'e']] #원하는 값만 부분부분 출력하는 것도 가능

a    0.0
c    0.5
e    1.0
dtype: float64

### Series 인덱싱

In [ ]:
s = pd.Series(['a', 'b', 'c', 'd', 'e'],
              index=[1, 3, 5, 7, 9])
s

1    a
3    b
5    c
7    d
9    e
dtype: object

In [ ]:
s[1]

'a'

In [ ]:
s[2:4]

5    c
7    d
dtype: object

In [ ]:
s.iloc[1] #int location

'b'

In [ ]:
s.iloc[0]

'a'

In [ ]:
s.iloc[2:4]

5    c
7    d
dtype: object

In [ ]:
s.reindex(range(10)) #0~9까지의 index로 바꿔주라

0    NaN
1      a
2    NaN
3      b
4    NaN
5      c
6    NaN
7      d
8    NaN
9      e
dtype: object

In [ ]:
s.reindex(range(10), method='bfill') #빈값은 바로 전의 값으로 붙여주라.

0    a
1    a
2    b
3    b
4    c
5    c
6    d
7    d
8    e
9    e
dtype: object

### DataFrame 인덱싱
|사용방법|설명|
|---|---|
|df[val]|하나의 컬럼 또는 여러 컬럼을 선택|
|df.loc[val]|라벨값으로 로우의 부분집합 선택|
|df.loc[:, val]|라벨값으로 컬럼의 부분집합 선택|
|df.loc[val1, val2]|라벨값으로 로우와 컬럼의 부분집합 선택|
|df.iloc[where]|정수 색인으로 로우의 부분집합 선택|
|df.iloc[:, where]|정수 색인으로 컬럼의 부분집합 선택|
|df.at[label_i, label_j]|로우와 컬럼의 라벨로 단일 값 선택|
|df.iat[i, j]|로우와 컬럼의 정수 색인으로 단일 값 선택|
|reindex|하나 이상의 축을 새로운 색인으로 재-색인|
|get_value, set_value|로우와 컬럼의 이름으로 값 선택|

In [ ]:
korea_df

         전체인구수    남자인구수    여자인구수
서울특별시  9720645  4732275  4988571
부산광역시  3404423  1668618  1735805
대구광역시  2427954  1476813  1470404
인천광역시  2947217  1198815  1229139
대전광역시  1471040   734441   736599
광주광역시  1455048   720060   734988

In [ ]:
korea_df['남자인구수']

서울특별시    4732275
부산광역시    1668618
대구광역시    1476813
인천광역시    1198815
대전광역시     734441
광주광역시     720060
Name: 남자인구수, dtype: int64

In [ ]:
korea_df.남자인구수

서울특별시    4732275
부산광역시    1668618
대구광역시    1476813
인천광역시    1198815
대전광역시     734441
광주광역시     720060
Name: 남자인구수, dtype: int64

In [ ]:
# korea_df."남자인구수"

In [ ]:
korea_df.여자인구수

서울특별시    4988571
부산광역시    1735805
대구광역시    1470404
인천광역시    1229139
대전광역시     736599
광주광역시     734988
Name: 여자인구수, dtype: int64

In [ ]:
korea_df['남여비율'] = (korea_df['남자인구수'] / korea_df['여자인구수']) * 100

In [ ]:
korea_df

         전체인구수    남자인구수    여자인구수        남여비율
서울특별시  9720645  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
대구광역시  2427954  1476813  1470404  100.435867
인천광역시  2947217  1198815  1229139   97.532907
대전광역시  1471040   734441   736599   99.707032
광주광역시  1455048   720060   734988   97.968946

In [ ]:
korea_df.남여비율

서울특별시     94.862336
부산광역시     96.129346
대구광역시    100.435867
인천광역시     97.532907
대전광역시     99.707032
광주광역시     97.968946
Name: 남여비율, dtype: float64

In [ ]:
korea_df.values #배열형태로 보여 줌

array([[9.72064500e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01],
       [3.40442300e+06, 1.66861800e+06, 1.73580500e+06, 9.61293463e+01],
       [2.42795400e+06, 1.47681300e+06, 1.47040400e+06, 1.00435867e+02],
       [2.94721700e+06, 1.19881500e+06, 1.22913900e+06, 9.75329072e+01],
       [1.47104000e+06, 7.34441000e+05, 7.36599000e+05, 9.97070319e+01],
       [1.45504800e+06, 7.20060000e+05, 7.34988000e+05, 9.79689464e+01]])

In [ ]:
korea_df.T

              서울특별시         부산광역시  ...         대전광역시         광주광역시
전체인구수  9.720645e+06  3.404423e+06  ...  1.471040e+06  1.455048e+06
남자인구수  4.732275e+06  1.668618e+06  ...  7.344410e+05  7.200600e+05
여자인구수  4.988571e+06  1.735805e+06  ...  7.365990e+05  7.349880e+05
남여비율   9.486234e+01  9.612935e+01  ...  9.970703e+01  9.796895e+01

[4 rows x 6 columns]

In [ ]:
korea_df.values[0]

array([9.72064500e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01])

In [ ]:
korea_df.values[0,0]

9720645.0

In [ ]:
korea_df.values[5,2]

734988.0

In [ ]:
korea_df['전체인구수']

서울특별시    9720645
부산광역시    3404423
대구광역시    2427954
인천광역시    2947217
대전광역시    1471040
광주광역시    1455048
Name: 전체인구수, dtype: int64

In [ ]:
korea_df.loc[:'인천광역시', :"남자인구수"]

         전체인구수    남자인구수
서울특별시  9720645  4732275
부산광역시  3404423  1668618
대구광역시  2427954  1476813
인천광역시  2947217  1198815

In [ ]:
korea_df.loc[(korea_df.여자인구수 > 1000000)]

         전체인구수    남자인구수    여자인구수        남여비율
서울특별시  9720645  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
대구광역시  2427954  1476813  1470404  100.435867
인천광역시  2947217  1198815  1229139   97.532907

In [ ]:
korea_df.loc[(korea_df.전체인구수 < 2000000)]

         전체인구수   남자인구수   여자인구수       남여비율
대전광역시  1471040  734441  736599  99.707032
광주광역시  1455048  720060  734988  97.968946

In [ ]:
korea_df.loc[(korea_df.전체인구수 > 2500000)]

         전체인구수    남자인구수    여자인구수       남여비율
서울특별시  9720645  4732275  4988571  94.862336
부산광역시  3404423  1668618  1735805  96.129346
인천광역시  2947217  1198815  1229139  97.532907

In [ ]:
korea_df.loc[korea_df.남여비율 > 100]

         전체인구수    남자인구수    여자인구수        남여비율
대구광역시  2427954  1476813  1470404  100.435867

In [ ]:
korea_df.loc[(korea_df.전체인구수 > 2500000) & (korea_df.남여비율 > 90)]

         전체인구수    남자인구수    여자인구수       남여비율
서울특별시  9720645  4732275  4988571  94.862336
부산광역시  3404423  1668618  1735805  96.129346
인천광역시  2947217  1198815  1229139  97.532907

In [ ]:
korea_df.iloc[:3, :2] #3행, 2열

         전체인구수    남자인구수
서울특별시  9720645  4732275
부산광역시  3404423  1668618
대구광역시  2427954  1476813

### 다중 인덱싱(Multi Indexing)

* 1차원의 Series와 2차원의 DataFrame 객체를 넘어 3차원, 4차원 이상의 고차원 데이터 처리
* 단일 인덱스 내에 여러 인덱스를 포함하는 다중 인덱싱

#### 다중 인덱스 Series

In [ ]:
korea_df

         전체인구수    남자인구수    여자인구수        남여비율
서울특별시  9720645  4732275  4988571   94.862336
부산광역시  3404423  1668618  1735805   96.129346
대구광역시  2427954  1476813  1470404  100.435867
인천광역시  2947217  1198815  1229139   97.532907
대전광역시  1471040   734441   736599   99.707032
광주광역시  1455048   720060   734988   97.968946

In [ ]:
idx_tuples = [('서울특별시', 2010), ('서울특별시', 2020),
              ('부산광역시', 2010), ('부산광역시', 2020),
              ('인천광역시', 2010), ('인천광역시', 2020),
              ('대구광역시', 2010), ('대구광역시', 2020),
              ('대전광역시', 2010), ('대전광역시', 2020),
              ('광주광역시', 2010), ('광주광역시', 2020)]

In [ ]:
idx_tuples #이것은 multiindexing이 아니고 중복된 값을 가지고 있는 형태임

[('서울특별시', 2010),
 ('서울특별시', 2020),
 ('부산광역시', 2010),
 ('부산광역시', 2020),
 ('인천광역시', 2010),
 ('인천광역시', 2020),
 ('대구광역시', 2010),
 ('대구광역시', 2020),
 ('대전광역시', 2010),
 ('대전광역시', 2020),
 ('광주광역시', 2010),
 ('광주광역시', 2020)]

In [ ]:
pop_tuples = [10312545, 9720846,
             2567910, 3404423,
             2758296, 2947217,
             2511676, 2427954,
             1503664, 1471040,
             1454636, 1455048]

In [ ]:
population = pd.Series(pop_tuples, index=idx_tuples)
population

(서울특별시, 2010)    10312545
(서울특별시, 2020)     9720846
(부산광역시, 2010)     2567910
(부산광역시, 2020)     3404423
(인천광역시, 2010)     2758296
(인천광역시, 2020)     2947217
(대구광역시, 2010)     2511676
(대구광역시, 2020)     2427954
(대전광역시, 2010)     1503664
(대전광역시, 2020)     1471040
(광주광역시, 2010)     1454636
(광주광역시, 2020)     1455048
dtype: int64

In [ ]:
midx = pd.MultiIndex.from_tuples(idx_tuples)
midx

MultiIndex([('서울특별시', 2010),
            ('서울특별시', 2020),
            ('부산광역시', 2010),
            ('부산광역시', 2020),
            ('인천광역시', 2010),
            ('인천광역시', 2020),
            ('대구광역시', 2010),
            ('대구광역시', 2020),
            ('대전광역시', 2010),
            ('대전광역시', 2020),
            ('광주광역시', 2010),
            ('광주광역시', 2020)],
           )

In [ ]:
population = population.reindex(midx)
population #멀티인덱싱이 만들어 져 있는 형태, 중복된 것이 아니라 서울특벽시 밑에 2010과 2020이 있는 형태임

서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [ ]:
population[:, 2010] #2010년까지만 보여줘

서울특별시    10312545
부산광역시     2567910
인천광역시     2758296
대구광역시     2511676
대전광역시     1503664
광주광역시     1454636
dtype: int64

In [ ]:
population['대전광역시', :] #대전광역시 인것 다 보여줘

2010    1503664
2020    1471040
dtype: int64

In [ ]:
korea_mdf = population.unstack() #전형적인 data frame구조로 바꿈
korea_mdf

           2010     2020
광주광역시   1454636  1455048
대구광역시   2511676  2427954
대전광역시   1503664  1471040
부산광역시   2567910  3404423
서울특별시  10312545  9720846
인천광역시   2758296  2947217

In [ ]:
korea_mdf.stack() #다중인덱싱 스텍으로 변환, 그러나 아래의 결과는 변환되지 않았음. 버그인가?

광주광역시  2010     1454636
       2020     1455048
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
부산광역시  2010     2567910
       2020     3404423
서울특별시  2010    10312545
       2020     9720846
인천광역시  2010     2758296
       2020     2947217
dtype: int64

In [ ]:
male_tuples = [5111259, 4732275,
              1773170, 1668618,
              1390356, 1476813,
              1255245, 1198815,
              753648, 734441,
              721780, 720060]
male_tuples

[5111259,
 4732275,
 1773170,
 1668618,
 1390356,
 1476813,
 1255245,
 1198815,
 753648,
 734441,
 721780,
 720060]

In [ ]:
korea_mdf = pd.DataFrame({'총인구수': population,
                          '남자인구수': male_tuples})
korea_mdf

                총인구수    남자인구수
서울특별시 2010  10312545  5111259
      2020   9720846  4732275
부산광역시 2010   2567910  1773170
      2020   3404423  1668618
인천광역시 2010   2758296  1390356
      2020   2947217  1476813
대구광역시 2010   2511676  1255245
      2020   2427954  1198815
대전광역시 2010   1503664   753648
      2020   1471040   734441
광주광역시 2010   1454636   721780
      2020   1455048   720060

In [ ]:
female_tuples = [5201285, 4988571,
              1794740, 1735805,
              1367940, 1470404,
              1256431, 1229139,
              750016, 736599,
              732856, 734988]
female_tuples

[5201285,
 4988571,
 1794740,
 1735805,
 1367940,
 1470404,
 1256431,
 1229139,
 750016,
 736599,
 732856,
 734988]

In [ ]:
korea_mdf = pd.DataFrame({'총인구수': population,
                          '남자인구수': male_tuples,
                          '여자인구수': female_tuples})
korea_mdf

                총인구수    남자인구수    여자인구수
서울특별시 2010  10312545  5111259  5201285
      2020   9720846  4732275  4988571
부산광역시 2010   2567910  1773170  1794740
      2020   3404423  1668618  1735805
인천광역시 2010   2758296  1390356  1367940
      2020   2947217  1476813  1470404
대구광역시 2010   2511676  1255245  1256431
      2020   2427954  1198815  1229139
대전광역시 2010   1503664   753648   750016
      2020   1471040   734441   736599
광주광역시 2010   1454636   721780   732856
      2020   1455048   720060   734988

In [ ]:
ratio = korea_mdf['남자인구수'] * 100 / korea_mdf['여자인구수']
ratio

서울특별시  2010     98.269158
       2020     94.862336
부산광역시  2010     98.798155
       2020     96.129346
인천광역시  2010    101.638668
       2020    100.435867
대구광역시  2010     99.905606
       2020     97.532907
대전광역시  2010    100.484256
       2020     99.707032
광주광역시  2010     98.488653
       2020     97.968946
dtype: float64

In [ ]:
ratio.unstack()

             2010        2020
광주광역시   98.488653   97.968946
대구광역시   99.905606   97.532907
대전광역시  100.484256   99.707032
부산광역시   98.798155   96.129346
서울특별시   98.269158   94.862336
인천광역시  101.638668  100.435867

In [ ]:
korea_mdf = pd.DataFrame({'총인구수': population,
                          '남자인구수': male_tuples,
                          '여자인구수': female_tuples,
                          '남여비율': ratio})
korea_mdf

                총인구수    남자인구수    여자인구수        남여비율
서울특별시 2010  10312545  5111259  5201285   98.269158
      2020   9720846  4732275  4988571   94.862336
부산광역시 2010   2567910  1773170  1794740   98.798155
      2020   3404423  1668618  1735805   96.129346
인천광역시 2010   2758296  1390356  1367940  101.638668
      2020   2947217  1476813  1470404  100.435867
대구광역시 2010   2511676  1255245  1256431   99.905606
      2020   2427954  1198815  1229139   97.532907
대전광역시 2010   1503664   753648   750016  100.484256
      2020   1471040   734441   736599   99.707032
광주광역시 2010   1454636   721780   732856   98.488653
      2020   1455048   720060   734988   97.968946

#### 다중 인덱스 생성

In [ ]:
df =  pd.DataFrame(np.random.rand(6, 3),
                   index=[['a', 'a', 'b', 'b', 'c', 'c'], [1, 2, 1, 2, 1, 2]],
                   columns=['c1', 'c2', 'c3'])
df

           c1        c2        c3
a 1  0.862241  0.997640  0.737681
  2  0.942492  0.017202  0.857789
b 1  0.254486  0.439428  0.589048
  2  0.507148  0.722619  0.683281
c 1  0.071674  0.928934  0.384209
  2  0.812582  0.818694  0.454498

In [ ]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b', 'c', 'c'], [1, 2, 1, 2, 1, 2]]) #Multiindex 하는 방법#1

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [ ]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2), ('c', 1), ('c', 2)]) #Multiindex하는 방법#2

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [ ]:
pd.MultiIndex.from_product([['a', 'b', 'c'],[1, 2]]) #2개 벡터를 곱하는 결과를 Multi Index로 만들어 주라

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [ ]:
pd.MultiIndex(levels=[['a', 'b', 'c'],[1, 2]],
              codes=[[0, 0, 1, 1, 2, 2],[0, 1, 0, 1, 0, 1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [ ]:
population

서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [ ]:
population.index.names = ['행정구역', '년도']
population

행정구역   년도
서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [ ]:
idx = pd.MultiIndex.from_product([['a', 'b', 'c'], [1, 2]],
                                 names=['name1', 'name2'])

cols = pd.MultiIndex.from_product([['c1', 'c2', 'c3'],[1, 2]],
                                  names=['col_name1', 'col_name2'])

data = np.round(np.random.randn(6, 6), 2)
mdf = pd.DataFrame(data, index=idx, columns=cols)
mdf

col_name1      c1          c2          c3
col_name2       1     2     1     2     1     2
name1 name2
a     1      1.07 -0.94 -0.39 -1.23 -1.06  0.21
      2      0.45 -0.44  1.09 -1.92  0.74  0.08
b     1     -1.75 -0.39  0.17 -0.73 -0.04  0.77
      2      0.12 -0.11 -0.71  0.26 -0.37  0.64
c     1     -0.07 -2.02 -0.04  1.48 -0.12  0.85
      2     -1.05  0.56  0.42  1.45 -0.23  1.62

In [ ]:
mdf['c2']

col_name2       1     2
name1 name2
a     1     -0.39 -1.23
      2      1.09 -1.92
b     1      0.17 -0.73
      2     -0.71  0.26
c     1     -0.04  1.48
      2      0.42  1.45

#### 인덱싱 및 슬라이싱

In [ ]:
population

행정구역   년도
서울특별시  2010    10312545
       2020     9720846
부산광역시  2010     2567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [ ]:
population['인천광역시', 2010]

2758296

In [ ]:
population[:, 2010]

행정구역
서울특별시    10312545
부산광역시     2567910
인천광역시     2758296
대구광역시     2511676
대전광역시     1503664
광주광역시     1454636
dtype: int64

In [ ]:
population[population > 10000000]

행정구역   년도
서울특별시  2010    10312545
dtype: int64

In [ ]:
population[['대구광역시', '대전광역시']]

행정구역   년도
대구광역시  2010    2511676
       2020    2427954
대전광역시  2010    1503664
       2020    1471040
dtype: int64

In [ ]:
mdf

col_name1      c1          c2          c3
col_name2       1     2     1     2     1     2
name1 name2
a     1      1.07 -0.94 -0.39 -1.23 -1.06  0.21
      2      0.45 -0.44  1.09 -1.92  0.74  0.08
b     1     -1.75 -0.39  0.17 -0.73 -0.04  0.77
      2      0.12 -0.11 -0.71  0.26 -0.37  0.64
c     1     -0.07 -2.02 -0.04  1.48 -0.12  0.85
      2     -1.05  0.56  0.42  1.45 -0.23  1.62

In [ ]:
mdf['c2', 2] #c2에 2번 column만

name1  name2
a      1       -1.23
       2       -1.92
b      1       -0.73
       2        0.26
c      1        1.48
       2        1.45
Name: (c2, 2), dtype: float64

In [ ]:
mdf.iloc[:3, :4] #정수인댁싱

col_name1      c1          c2
col_name2       1     2     1     2
name1 name2
a     1      1.07 -0.94 -0.39 -1.23
      2      0.45 -0.44  1.09 -1.92
b     1     -1.75 -0.39  0.17 -0.73

In [ ]:
mdf.loc[:, ('c2', 1)]

name1  name2
a      1       -0.39
       2        1.09
b      1        0.17
       2       -0.71
c      1       -0.04
       2        0.42
Name: (c2, 1), dtype: float64

In [ ]:
idx_slice = pd.IndexSlice
mdf.loc[idx_slice[:, 2], idx_slice[:, 2]]

col_name1      c1    c2    c3
col_name2       2     2     2
name1 name2
a     2     -0.44 -1.92  0.08
b     2     -0.11  0.26  0.64
c     2      0.56  1.45  1.62

#### 다중 인덱스 재정렬

In [ ]:
idx

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           names=['name1', 'name2'])

In [ ]:
korea_mdf

                총인구수    남자인구수    여자인구수        남여비율
행정구역  년도
서울특별시 2010  10312545  5111259  5201285   98.269158
      2020   9720846  4732275  4988571   94.862336
부산광역시 2010   2567910  1773170  1794740   98.798155
      2020   3404423  1668618  1735805   96.129346
인천광역시 2010   2758296  1390356  1367940  101.638668
      2020   2947217  1476813  1470404  100.435867
대구광역시 2010   2511676  1255245  1256431   99.905606
      2020   2427954  1198815  1229139   97.532907
대전광역시 2010   1503664   753648   750016  100.484256
      2020   1471040   734441   736599   99.707032
광주광역시 2010   1454636   721780   732856   98.488653
      2020   1455048   720060   734988   97.968946

In [ ]:
#korea_mdf['서울특별시':'인천광역시'] # UnsortedIndexError  발생, 슬라이스의 결과를 보여줄려면 정렬이 되어있어야 한다. 정렬이 않되어 있어 발생하는 에러

korea_mdf = korea_mdf.sort_index()
korea_mdf

                총인구수    남자인구수    여자인구수        남여비율
행정구역  년도
광주광역시 2010   1454636   721780   732856   98.488653
      2020   1455048   720060   734988   97.968946
대구광역시 2010   2511676  1255245  1256431   99.905606
      2020   2427954  1198815  1229139   97.532907
대전광역시 2010   1503664   753648   750016  100.484256
      2020   1471040   734441   736599   99.707032
부산광역시 2010   2567910  1773170  1794740   98.798155
      2020   3404423  1668618  1735805   96.129346
서울특별시 2010  10312545  5111259  5201285   98.269158
      2020   9720846  4732275  4988571   94.862336
인천광역시 2010   2758296  1390356  1367940  101.638668
      2020   2947217  1476813  1470404  100.435867

In [ ]:
korea_mdf['서울특별시':'인천광역시']

                총인구수    남자인구수    여자인구수        남여비율
행정구역  년도
서울특별시 2010  10312545  5111259  5201285   98.269158
      2020   9720846  4732275  4988571   94.862336
인천광역시 2010   2758296  1390356  1367940  101.638668
      2020   2947217  1476813  1470404  100.435867

In [ ]:
korea_mdf.unstack(level=0)

         총인구수                    ...       남여비율
행정구역    광주광역시    대구광역시    대전광역시  ...      부산광역시      서울특별시       인천광역시
년도                               ...
2010  1454636  2511676  1503664  ...  98.798155  98.269158  101.638668
2020  1455048  2427954  1471040  ...  96.129346  94.862336  100.435867

[2 rows x 24 columns]

In [ ]:
korea_mdf.unstack(level=1)

           총인구수             남자인구수  ...    여자인구수        남여비율
년도         2010     2020     2010  ...     2020        2010        2020
행정구역                               ...
광주광역시   1454636  1455048   721780  ...   734988   98.488653   97.968946
대구광역시   2511676  2427954  1255245  ...  1229139   99.905606   97.532907
대전광역시   1503664  1471040   753648  ...   736599  100.484256   99.707032
부산광역시   2567910  3404423  1773170  ...  1735805   98.798155   96.129346
서울특별시  10312545  9720846  5111259  ...  4988571   98.269158   94.862336
인천광역시   2758296  2947217  1390356  ...  1470404  101.638668  100.435867

[6 rows x 8 columns]

In [ ]:
korea_mdf.stack()

행정구역   년도
광주광역시  2010  총인구수     1.454636e+06
             남자인구수    7.217800e+05
             여자인구수    7.328560e+05
             남여비율     9.848865e+01
       2020  총인구수     1.455048e+06
             남자인구수    7.200600e+05
             여자인구수    7.349880e+05
             남여비율     9.796895e+01
대구광역시  2010  총인구수     2.511676e+06
             남자인구수    1.255245e+06
             여자인구수    1.256431e+06
             남여비율     9.990561e+01
       2020  총인구수     2.427954e+06
             남자인구수    1.198815e+06
             여자인구수    1.229139e+06
             남여비율     9.753291e+01
대전광역시  2010  총인구수     1.503664e+06
             남자인구수    7.536480e+05
             여자인구수    7.500160e+05
             남여비율     1.004843e+02
       2020  총인구수     1.471040e+06
             남자인구수    7.344410e+05
             여자인구수    7.365990e+05
             남여비율     9.970703e+01
부산광역시  2010  총인구수     2.567910e+06
             남자인구수    1.773170e+06
             여자인구수    1.794740e+06
             남여비율     9.879815e+01
       2020  총인구수     3.404423e+06
             남자인구수    1.668618e+06
             여자인구수    1.735805e+06
             남여비율     9.612935e+01
서울특별시  2010  총인구수     1.031254e+07
             남자인구수    5.111259e+06
             여자인구수    5.201285e+06
             남여비율     9.826916e+01
       2020  총인구수     9.720846e+06
             남자인구수    4.732275e+06
             여자인구수    4.988571e+06
             남여비율     9.486234e+01
인천광역시  2010  총인구수     2.758296e+06
             남자인구수    1.390356e+06
             여자인구수    1.367940e+06
             남여비율     1.016387e+02
       2020  총인구수     2.947217e+06
             남자인구수    1.476813e+06
             여자인구수    1.470404e+06
             남여비율     1.004359e+02
dtype: float64

In [ ]:
korea_mdf

                총인구수    남자인구수    여자인구수        남여비율
행정구역  년도
광주광역시 2010   1454636   721780   732856   98.488653
      2020   1455048   720060   734988   97.968946
대구광역시 2010   2511676  1255245  1256431   99.905606
      2020   2427954  1198815  1229139   97.532907
대전광역시 2010   1503664   753648   750016  100.484256
      2020   1471040   734441   736599   99.707032
부산광역시 2010   2567910  1773170  1794740   98.798155
      2020   3404423  1668618  1735805   96.129346
서울특별시 2010  10312545  5111259  5201285   98.269158
      2020   9720846  4732275  4988571   94.862336
인천광역시 2010   2758296  1390356  1367940  101.638668
      2020   2947217  1476813  1470404  100.435867

In [ ]:
idx_flat = korea_mdf.reset_index(level=0)
idx_flat

       행정구역      총인구수    남자인구수    여자인구수        남여비율
년도
2010  광주광역시   1454636   721780   732856   98.488653
2020  광주광역시   1455048   720060   734988   97.968946
2010  대구광역시   2511676  1255245  1256431   99.905606
2020  대구광역시   2427954  1198815  1229139   97.532907
2010  대전광역시   1503664   753648   750016  100.484256
2020  대전광역시   1471040   734441   736599   99.707032
2010  부산광역시   2567910  1773170  1794740   98.798155
2020  부산광역시   3404423  1668618  1735805   96.129346
2010  서울특별시  10312545  5111259  5201285   98.269158
2020  서울특별시   9720846  4732275  4988571   94.862336
2010  인천광역시   2758296  1390356  1367940  101.638668
2020  인천광역시   2947217  1476813  1470404  100.435867

In [ ]:
idx_flat = korea_mdf.reset_index(level=(0, 1))
idx_flat

     행정구역    년도      총인구수    남자인구수    여자인구수        남여비율
0   광주광역시  2010   1454636   721780   732856   98.488653
1   광주광역시  2020   1455048   720060   734988   97.968946
2   대구광역시  2010   2511676  1255245  1256431   99.905606
3   대구광역시  2020   2427954  1198815  1229139   97.532907
4   대전광역시  2010   1503664   753648   750016  100.484256
5   대전광역시  2020   1471040   734441   736599   99.707032
6   부산광역시  2010   2567910  1773170  1794740   98.798155
7   부산광역시  2020   3404423  1668618  1735805   96.129346
8   서울특별시  2010  10312545  5111259  5201285   98.269158
9   서울특별시  2020   9720846  4732275  4988571   94.862336
10  인천광역시  2010   2758296  1390356  1367940  101.638668
11  인천광역시  2020   2947217  1476813  1470404  100.435867

In [ ]:
idx_flat.set_index(['행정구역', '년도'])

                총인구수    남자인구수    여자인구수        남여비율
행정구역  년도
광주광역시 2010   1454636   721780   732856   98.488653
      2020   1455048   720060   734988   97.968946
대구광역시 2010   2511676  1255245  1256431   99.905606
      2020   2427954  1198815  1229139   97.532907
대전광역시 2010   1503664   753648   750016  100.484256
      2020   1471040   734441   736599   99.707032
부산광역시 2010   2567910  1773170  1794740   98.798155
      2020   3404423  1668618  1735805   96.129346
서울특별시 2010  10312545  5111259  5201285   98.269158
      2020   9720846  4732275  4988571   94.862336
인천광역시 2010   2758296  1390356  1367940  101.638668
      2020   2947217  1476813  1470404  100.435867

## 데이터 연산

In [ ]:
s = pd.Series(np.random.randint(0, 10, 5))
s

0    5
1    3
2    8
3    0
4    1
dtype: int64

In [ ]:
df = pd.DataFrame(np.random.randint(0, 10, (3, 3)),
                  columns=['A', 'B', 'C'])
df

   A  B  C
0  3  6  2
1  2  4  9
2  7  7  0

In [ ]:
np.exp(s)

0     148.413159
1      20.085537
2    2980.957987
3       1.000000
4       2.718282
dtype: float64

In [ ]:
np.cos(df * np.pi / 4)

              A             B             C
0 -7.071068e-01 -1.836970e-16  6.123234e-17
1  6.123234e-17 -1.000000e+00  7.071068e-01
2  7.071068e-01  7.071068e-01  1.000000e+00

In [ ]:
s1 = pd.Series([1, 3, 5, 7, 9], index=[0, 1, 2, 3, 4])
s2 = pd.Series([2, 4, 6, 8, 10], index=[1, 2, 3, 4, 5])
s1 + s2 #결과적으로 같은 index끼리만 덧셈연산

0     NaN
1     5.0
2     9.0
3    13.0
4    17.0
5     NaN
dtype: float64

In [ ]:
s1.add(s2, fill_value=0)

0     1.0
1     5.0
2     9.0
3    13.0
4    17.0
5    10.0
dtype: float64

In [ ]:
df1 = pd.DataFrame(np.random.randint(0, 20, (3, 3)),
                   columns=list('ACD'))
df1

    A  C   D
0   4  1   9
1  17  6  10
2  19  9  13

In [ ]:
df2 = pd.DataFrame(np.random.randint(0, 20, (5, 5)),
                   columns = list('BAECD'))
df2

    B   A   E   C   D
0   7  12  11  18   1
1   7   6   4  10  10
2  13  13  14   9  13
3   4  10  17   0   3
4  13  14  18   7  13

In [ ]:
df1 + df2

      A   B     C     D   E
0  16.0 NaN  19.0  10.0 NaN
1  23.0 NaN  16.0  20.0 NaN
2  32.0 NaN  18.0  26.0 NaN
3   NaN NaN   NaN   NaN NaN
4   NaN NaN   NaN   NaN NaN

In [ ]:
fvalue = df1.stack().mean()
df1.add(df2, fill_value=fvalue)

           A          B          C          D          E
0  16.000000  16.777778  19.000000  10.000000  20.777778
1  23.000000  16.777778  16.000000  20.000000  13.777778
2  32.000000  22.777778  18.000000  26.000000  23.777778
3  19.777778  13.777778   9.777778  12.777778  26.777778
4  23.777778  22.777778  16.777778  22.777778  27.777778

### 연산자 범용 함수
|Python 연산자| pandas 메소드|
|---|---|
|```+```| add, radd|
|```-```| sub, rsub, subtract|
|```*```| mul, rmul, multiply|
|```/```| truediv, div, rdiv, divide|
|```//```| floordiv, rfloordiv|
|```%```| mod|
|```**```| pow, rpow|

#### add()

In [ ]:
a = np.random.randint(1, 10, size=(3, 3))
a

array([[7, 8, 9],
       [4, 1, 7],
       [1, 1, 5]])

In [ ]:
a + a[0] #broadcasting한 후 연산

array([[14, 16, 18],
       [11,  9, 16],
       [ 8,  9, 14]])

In [ ]:
df = pd.DataFrame(a, columns=list('ABC'))
df

   A  B  C
0  7  8  9
1  4  1  7
2  1  1  5

In [ ]:
df + df.iloc[0]

    A   B   C
0  14  16  18
1  11   9  16
2   8   9  14

In [ ]:
df.add(df.iloc[0]) #전반적으로 NumPy에서 사용하는 연산자와 동일한 방식으로 동작함, 기본적으로 pandas가 numpy 기반으로 만들어 졌기 때문에 같은 연산자로 사용이 가능함

    A   B   C
0  14  16  18
1  11   9  16
2   8   9  14

#### sub() / subtract()

In [ ]:
a

array([[7, 8, 9],
       [4, 1, 7],
       [1, 1, 5]])

In [ ]:
a - a[0] #broadcasting 한후 처리함

array([[ 0,  0,  0],
       [-3, -7, -2],
       [-6, -7, -4]])

In [ ]:
df

   A  B  C
0  7  8  9
1  4  1  7
2  1  1  5

In [ ]:
df - df.iloc[0]

   A  B  C
0  0  0  0
1 -3 -7 -2
2 -6 -7 -4

In [ ]:
df.sub(df.iloc[0])

   A  B  C
0  0  0  0
1 -3 -7 -2
2 -6 -7 -4

In [ ]:
df.subtract(df['B'], axis=0) #2차원이기 때문에 축 지정가능, 'B'열로 자기가 자기를 빼서 모두 0이 됨

   A  B  C
0 -1  0  1
1  3  0  6
2  0  0  4

#### mul() / multply()

In [ ]:
a

array([[7, 8, 9],
       [4, 1, 7],
       [1, 1, 5]])

In [ ]:
a * a[1]

array([[28,  8, 63],
       [16,  1, 49],
       [ 4,  1, 35]])

In [ ]:
df

   A  B  C
0  7  8  9
1  4  1  7
2  1  1  5

In [ ]:
df * df.iloc[1]

    A  B   C
0  28  8  63
1  16  1  49
2   4  1  35

In [ ]:
df.mul(df.iloc[1])

    A  B   C
0  28  8  63
1  16  1  49
2   4  1  35

In [ ]:
df.multiply(df.iloc[2])

   A  B   C
0  7  8  45
1  4  1  35
2  1  1  25

### 나누기
#### truediv() /  div() / divide() / floordiv()

In [ ]:
a

array([[7, 8, 9],
       [4, 1, 7],
       [1, 1, 5]])

In [ ]:
a / a[0]

array([[1.        , 1.        , 1.        ],
       [0.57142857, 0.125     , 0.77777778],
       [0.14285714, 0.125     , 0.55555556]])

In [ ]:
df

   A  B  C
0  7  8  9
1  4  1  7
2  1  1  5

In [ ]:
df / df.iloc[0]

          A      B         C
0  1.000000  1.000  1.000000
1  0.571429  0.125  0.777778
2  0.142857  0.125  0.555556

In [ ]:
df.truediv(df.iloc[0])

          A      B         C
0  1.000000  1.000  1.000000
1  0.571429  0.125  0.777778
2  0.142857  0.125  0.555556

In [ ]:
df.div(df.iloc[1])

      A    B         C
0  1.75  8.0  1.285714
1  1.00  1.0  1.000000
2  0.25  1.0  0.714286

In [ ]:
df.divide(df.iloc[2])

     A    B    C
0  7.0  8.0  1.8
1  4.0  1.0  1.4
2  1.0  1.0  1.0

In [ ]:
a // a[0] #floor_div

array([[1, 1, 1],
       [0, 0, 0],
       [0, 0, 0]])

In [ ]:
df.floordiv(df.iloc[0])

   A  B  C
0  1  1  1
1  0  0  0
2  0  0  0

#### mod() : 나머지

In [ ]:
a

array([[7, 8, 9],
       [4, 1, 7],
       [1, 1, 5]])

In [ ]:
a % a[0]

array([[0, 0, 0],
       [4, 1, 7],
       [1, 1, 5]])

In [ ]:
df

   A  B  C
0  7  8  9
1  4  1  7
2  1  1  5

In [ ]:
df.mod(df.iloc[0])

   A  B  C
0  0  0  0
1  4  1  7
2  1  1  5

#### pow()

In [ ]:
a

array([[7, 8, 9],
       [4, 1, 7],
       [1, 1, 5]])

In [ ]:
a ** a[0]

array([[   823543,  16777216, 387420489],
       [    16384,         1,  40353607],
       [        1,         1,   1953125]])

In [ ]:
df

   A  B  C
0  7  8  9
1  4  1  7
2  1  1  5

In [ ]:
df.pow(df.iloc[0])

        A         B          C
0  823543  16777216  387420489
1   16384         1   40353607
2       1         1    1953125

In [ ]:
row = df.iloc[0, ::2] #step을 2로
row #일부만 뽑아서

A    7
C    9
Name: 0, dtype: int64

In [ ]:
df - row

     A   B    C
0  0.0 NaN  0.0
1 -3.0 NaN -2.0
2 -6.0 NaN -4.0

### 정렬(Sort)

In [ ]:
s = pd.Series(range(5), index=['A', 'D', 'B', 'C', 'E'])
s

A    0
D    1
B    2
C    3
E    4
dtype: int64

In [ ]:
s.sort_index()

A    0
B    2
C    3
D    1
E    4
dtype: int64

In [ ]:
s

A    0
D    1
B    2
C    3
E    4
dtype: int64

In [ ]:
s.sort_values()

A    0
D    1
B    2
C    3
E    4
dtype: int64

In [ ]:
df = pd.DataFrame(np.random.randint(1, 10, (4, 4)),
                  index=[2, 4, 1, 3],
                  columns=list('BDAC'))
df

   B  D  A  C
2  4  6  5  7
4  1  3  7  7
1  4  4  4  2
3  5  5  6  9

In [ ]:
df.sort_index()

   B  D  A  C
1  4  4  4  2
2  4  6  5  7
3  5  5  6  9
4  1  3  7  7

In [ ]:
df.sort_index(axis=1) #열 "B D A C"가 "A B C D"로 정렬딤

   A  B  C  D
2  5  4  7  6
4  7  1  7  3
1  4  4  2  4
3  6  5  9  5

In [ ]:
df.sort_values(by='A') #다음 셀과 결과가 같음

   B  D  A  C
1  4  4  4  2
2  4  6  5  7
3  5  5  6  9
4  1  3  7  7

In [ ]:
df.sort_values(by=['A']) #2차원이라 기준 필드를 정해주어야 함

   B  D  A  C
1  4  4  4  2
2  4  6  5  7
3  5  5  6  9
4  1  3  7  7

In [ ]:
df.sort_values(by=['A', 'C']) #먼저 A를 기분으로 정렬 한 후 C를 기준으로 정렬함.

   B  D  A  C
1  4  4  4  2
2  4  6  5  7
3  5  5  6  9
4  1  3  7  7

### 순위(Ranking)

|메소드|설명|
|---|---|
|```average```|기본값, 순위에 같은 값을 가지는 항목들의 평균값을 사용|
|```min```|같은 값을 가지는 그룹을 낮은 순위로 지정|
|```max```|같은 값을 가지는 구룹을 높은 순위로 지정|
|```first```|데이터 내의 위치에 따라 순위 지정|
|```dense```|같은 그룹 내에서 모두 같은 순위를 적용하지 않고 1씩 증가|

In [ ]:
s = pd.Series([-2, 4, 7, 3, 0, 7, 5, -4, 2, 6])
s

0   -2
1    4
2    7
3    3
4    0
5    7
6    5
7   -4
8    2
9    6
dtype: int64

In [ ]:
s.rank() #7번 -4를 1.0로 보고 그 위쪽으로 순위를 정함

0    2.0
1    6.0
2    9.5
3    5.0
4    3.0
5    9.5
6    7.0
7    1.0
8    4.0
9    8.0
dtype: float64

In [ ]:
s.rank(method='first') #원래 2도 7이고, 5도 7이었는데 같은 값에도 불구하고 먼저 나온놈의 순위를 높여줌

0     2.0
1     6.0
2     9.0
3     5.0
4     3.0
5    10.0
6     7.0
7     1.0
8     4.0
9     8.0
dtype: float64

In [ ]:
s.rank(method='max') #2에 7, 5에 7을 같은 10.0로 만들어 놓음, 위의 셀 2의 9.0이 사라지고 MAX인 5의 10.0으로 바뀜.

0     2.0
1     6.0
2    10.0
3     5.0
4     3.0
5    10.0
6     7.0
7     1.0
8     4.0
9     8.0
dtype: float64

### 고성능 연산
* pandas가 대용량 DataFrame을 빠르게 연산하도록 한 기능들
* .eval() 
* .query()

In [ ]:
nrows, ncols = 100000, 100
df1, df2, df3, df4 = (pd.DataFrame(np.random.rand(nrows, ncols)) for i in range(4))

In [ ]:
%timeit df1 + df2 + df3 +df4

10 loops, best of 5: 60.1 ms per loop

In [ ]:
%timeit pd.eval('df1 + df2 + df3 + df4')

10 loops, best of 5: 40.4 ms per loop

In [ ]:
%timeit df1 * (-df2) / (-df3 * df4)

10 loops, best of 5: 90.1 ms per loop

In [ ]:
%timeit pd.eval('df1 * (-df2) / (-df3 * df4)')

10 loops, best of 5: 50.5 ms per loop

In [ ]:
%timeit (df1 < df2) & (df2 <= df3) & (df3 != df4)

10 loops, best of 5: 59.1 ms per loop

In [ ]:
%timeit pd.eval('(df1 < df2) & (df2 <= df3) & (df3 != df4)')

10 loops, best of 5: 92.3 ms per loop

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df =  pd.DataFrame(np.random.rand(10000000, 5), columns=['A', 'B', 'C', 'D', 'E']) #100만 이상이면 메모리 터짐
df.head()

          A         B         C         D         E
0  0.562275  0.091552  0.621612  0.836389  0.142864
1  0.397181  0.836181  0.822754  0.751866  0.506410
2  0.119841  0.764650  0.723250  0.625737  0.986019
3  0.237176  0.576321  0.782375  0.505033  0.811134
4  0.334402  0.971458  0.716437  0.074681  0.694662

In [ ]:
%timeit df['A'] + df['B'] / df['C'] - df['D'] * df['E']

10 loops, best of 5: 140 ms per loop

In [ ]:
%timeit pd.eval('df.A + df.B / df.C - df.D * df.E')

10 loops, best of 5: 54.9 ms per loop

In [ ]:
%timeit df.eval('A + B / C - D * E') #심지어 컬럼명으로 연산도 가능함, 이것은 .eval()함수에서는 되는 것이겠지!! scan 비용때문에 약가 더 걸림

10 loops, best of 5: 89.2 ms per loop

In [ ]:
%timeit df.eval('R = A + B / C - D * E', inplace=True)
df.head()

10 loops, best of 5: 123 ms per loop

          A         B         C         D         E         R
0  0.562275  0.091552  0.621612  0.836389  0.142864  0.590067
1  0.397181  0.836181  0.822754  0.751866  0.506410  1.032749
2  0.119841  0.764650  0.723250  0.625737  0.986019  0.560094
3  0.237176  0.576321  0.782375  0.505033  0.811134  0.564157
4  0.334402  0.971458  0.716437  0.074681  0.694662  1.638481

In [ ]:
%timeit df.eval('R = A - B / C + D * E', inplace=True) #계산식 반영
df.head()

10 loops, best of 5: 123 ms per loop

          A         B         C         D         E         R
0  0.562275  0.091552  0.621612  0.836389  0.142864  0.534482
1  0.397181  0.836181  0.822754  0.751866  0.506410 -0.238387
2  0.119841  0.764650  0.723250  0.625737  0.986019 -0.320413
3  0.237176  0.576321  0.782375  0.505033  0.811134 -0.089805
4  0.334402  0.971458  0.716437  0.074681  0.694662 -0.969678

In [ ]:
%timeit col_mean = df.mean(1)
df['A'] + col_mean

10 loops, best of 5: 106 ms per loop

0          1.027137
1          0.909848
2          0.603021
3          0.707548
4          0.638062
             ...
9999995    0.114882
9999996    1.507266
9999997    1.696873
9999998    1.351932
9999999    1.672179
Length: 10000000, dtype: float64

In [ ]:
%timeit df.eval('A + @col_mean')
df.head()

10 loops, best of 5: 56.7 ms per loop

          A         B         C         D         E         R
0  0.562275  0.091552  0.621612  0.836389  0.142864  0.534482
1  0.397181  0.836181  0.822754  0.751866  0.506410 -0.238387
2  0.119841  0.764650  0.723250  0.625737  0.986019 -0.320413
3  0.237176  0.576321  0.782375  0.505033  0.811134 -0.089805
4  0.334402  0.971458  0.716437  0.074681  0.694662 -0.969678

In [ ]:
%timeit df[(df.A < 0.5) & (df.B < 0.4) & (df.C > 0.5)] 
df.head()

10 loops, best of 5: 138 ms per loop

          A         B         C         D         E         R
0  0.562275  0.091552  0.621612  0.836389  0.142864  0.534482
1  0.397181  0.836181  0.822754  0.751866  0.506410 -0.238387
2  0.119841  0.764650  0.723250  0.625737  0.986019 -0.320413
3  0.237176  0.576321  0.782375  0.505033  0.811134 -0.089805
4  0.334402  0.971458  0.716437  0.074681  0.694662 -0.969678

In [ ]:
%timeit pd.eval('df[(df.A < 0.5) & (df.B < 0.4) & (df.C > 0.5)]')
df.head()

1 loop, best of 5: 198 ms per loop

          A         B         C         D         E         R
0  0.562275  0.091552  0.621612  0.836389  0.142864  0.534482
1  0.397181  0.836181  0.822754  0.751866  0.506410 -0.238387
2  0.119841  0.764650  0.723250  0.625737  0.986019 -0.320413
3  0.237176  0.576321  0.782375  0.505033  0.811134 -0.089805
4  0.334402  0.971458  0.716437  0.074681  0.694662 -0.969678

In [ ]:
df.query('(A < 0.5) and (B < 0.4) and (C > 0.5)') #이런 방법도 있음

                A         B         C         D         E         R
42       0.218688  0.031784  0.620736  0.550781  0.956345  0.694222
44       0.132547  0.043637  0.604046  0.963067  0.492702  0.534811
49       0.468706  0.036334  0.591454  0.875842  0.048950  0.450147
51       0.225828  0.015282  0.852526  0.742071  0.120600  0.297397
75       0.171331  0.349414  0.614331  0.336249  0.160042 -0.343626
...           ...       ...       ...       ...       ...       ...
9999950  0.346824  0.395797  0.993594  0.015392  0.520479 -0.043515
9999954  0.218156  0.017120  0.563860  0.097162  0.324333  0.219307
9999964  0.122860  0.021213  0.822314  0.434304  0.752284  0.423784
9999978  0.418369  0.224771  0.970716  0.395113  0.536504  0.398797
9999993  0.300432  0.165737  0.541427  0.843429  0.422023  0.350267

[998871 rows x 6 columns]

In [ ]:
col_mean = df['D'].mean()
df[(df.A < col_mean) & (df.B < col_mean)] #조건으로 사용

                A         B         C         D         E         R
18       0.041356  0.100198  0.276245  0.394440  0.882333  0.026671
20       0.217123  0.477318  0.967689  0.242053  0.213274 -0.224509
24       0.495072  0.140023  0.031527  0.244819  0.197128 -3.897975
30       0.032821  0.358893  0.380760  0.818501  0.406686 -0.576875
32       0.195088  0.357181  0.201610  0.426953  0.975694 -1.159978
...           ...       ...       ...       ...       ...       ...
9999981  0.332362  0.063484  0.099762  0.721682  0.810340  0.280811
9999984  0.236359  0.117069  0.422315  0.881178  0.246078  0.175990
9999985  0.436645  0.436728  0.887461  0.615426  0.547837  0.281689
9999993  0.300432  0.165737  0.541427  0.843429  0.422023  0.350267
9999995  0.226616  0.477112  0.191477  0.531367  0.109802 -2.206779

[2497448 rows x 6 columns]

In [ ]:
df.query('A < @col_mean & B < @col_mean')

                A         B         C         D         E         R
18       0.041356  0.100198  0.276245  0.394440  0.882333  0.026671
20       0.217123  0.477318  0.967689  0.242053  0.213274 -0.224509
24       0.495072  0.140023  0.031527  0.244819  0.197128 -3.897975
30       0.032821  0.358893  0.380760  0.818501  0.406686 -0.576875
32       0.195088  0.357181  0.201610  0.426953  0.975694 -1.159978
...           ...       ...       ...       ...       ...       ...
9999981  0.332362  0.063484  0.099762  0.721682  0.810340  0.280811
9999984  0.236359  0.117069  0.422315  0.881178  0.246078  0.175990
9999985  0.436645  0.436728  0.887461  0.615426  0.547837  0.281689
9999993  0.300432  0.165737  0.541427  0.843429  0.422023  0.350267
9999995  0.226616  0.477112  0.191477  0.531367  0.109802 -2.206779

[2497448 rows x 6 columns]

## 데이터 결합

### Concat() / Append()

In [ ]:
s1 = pd.Series(['a', 'b'], index=[1, 2])
s2 = pd.Series(['c', 'd'], index=[3, 4])
pd.concat([s1, s2])

1    a
2    b
3    c
4    d
dtype: object

In [ ]:
def create_df(cols, idx):
  data =  {c: [str(c.lower()) + str(i) for i in idx] for c in cols}
  return pd.DataFrame(data, idx)
###

In [ ]:
df1 = create_df('AB', [1, 2])
df1

    A   B
1  a1  b1
2  a2  b2

In [ ]:
df2 = create_df('AB', [3, 4])
df2

    A   B
3  a3  b3
4  a4  b4

In [ ]:
pd.concat([df1, df2])

    A   B
1  a1  b1
2  a2  b2
3  a3  b3
4  a4  b4

In [ ]:
df3 = create_df('AB', [0, 1])
df3

    A   B
0  a0  b0
1  a1  b1

In [ ]:
df4 = create_df('CD', [0, 1])
df4

    C   D
0  c0  d0
1  c1  d1

In [ ]:
pd.concat([df3, df4])

     A    B    C    D
0   a0   b0  NaN  NaN
1   a1   b1  NaN  NaN
0  NaN  NaN   c0   d0
1  NaN  NaN   c1   d1

In [ ]:
pd.concat([df3, df4], axis=1)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1

In [ ]:
pd.concat([df1, df3])

    A   B
1  a1  b1
2  a2  b2
0  a0  b0
1  a1  b1

In [ ]:
pd.concat([df3, df4], verify_integrity=True) #에러발생하는 것이 정상, 결합하지 말라는 이야기, 왜 Index가 중복이 생기기 때문

ValueError: ignored

In [ ]:
pd.concat([df1, df3], ignore_index=True)

    A   B
0  a1  b1
1  a2  b2
2  a0  b0
3  a1  b1

In [ ]:
pd.concat([df1, df3], keys=['X', 'Y']) #멀티인덱스 구조처럼 X, Y가 추가됨

      A   B
X 1  a1  b1
  2  a2  b2
Y 0  a0  b0
  1  a1  b1

In [ ]:
df5 = create_df('ABC', [1, 2])
df6 = create_df('BCD', [3, 4])
pd.concat([df5, df6])

     A   B   C    D
1   a1  b1  c1  NaN
2   a2  b2  c2  NaN
3  NaN  b3  c3   d3
4  NaN  b4  c4   d4

In [ ]:
pd.concat([df5, df6], join='inner') #조인이 되는 부분만, 둘다 존재하는 부분만 조인함

    B   C
1  b1  c1
2  b2  c2
3  b3  c3
4  b4  c4

In [ ]:
df5.append(df6)

     A   B   C    D
1   a1  b1  c1  NaN
2   a2  b2  c2  NaN
3  NaN  b3  c3   d3
4  NaN  b4  c4   d4

### 병합과 조인

In [ ]:
df1 = pd.DataFrame({'학생': ['홍길동', '이순신', '임꺽정', '김유신'],
                  '학과': ['경영학과', '교육학과', '컴퓨터학과', '통계학과']})
df1

    학생     학과
0  홍길동   경영학과
1  이순신   교육학과
2  임꺽정  컴퓨터학과
3  김유신   통계학과

In [ ]:
df2 = pd.DataFrame({'학생':['홍길동', '이순신', '임꺽정', '김유신'],
                    '입학년도': [2012, 2016, 2019, 2020]})
df2

    학생  입학년도
0  홍길동  2012
1  이순신  2016
2  임꺽정  2019
3  김유신  2020

In [ ]:
df3 = pd.merge(df1, df2)
df3

    학생     학과  입학년도
0  홍길동   경영학과  2012
1  이순신   교육학과  2016
2  임꺽정  컴퓨터학과  2019
3  김유신   통계학과  2020

In [ ]:
df4 = pd.DataFrame({'학과': ['경영학과', '교육학과', '컴퓨터학과', '통계학과'],
                    '학과장': ['황희', '장영실', '안창호', '정약용']})
df4

      학과  학과장
0   경영학과   황희
1   교육학과  장영실
2  컴퓨터학과  안창호
3   통계학과  정약용

In [ ]:
pd.merge(df3, df4)

    학생     학과  입학년도  학과장
0  홍길동   경영학과  2012   황희
1  이순신   교육학과  2016  장영실
2  임꺽정  컴퓨터학과  2019  안창호
3  김유신   통계학과  2020  정약용

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df5 = pd.DataFrame({'학과': ['경영학과', '교육학과', '교육학과',  '컴퓨터학과', '컴퓨터학과', '통계학과'],
                    '과목': ['경영학개론', '교육학개론', '상담심리', '프로그래밍', '운영체제', '확률론']})
df5

      학과     과목
0   경영학과  경영학개론
1   교육학과  교육학개론
2   교육학과   상담심리
3  컴퓨터학과  프로그래밍
4  컴퓨터학과   운영체제
5   통계학과    확률론

In [ ]:
pd.merge(df1, df5)

    학생     학과     과목
0  홍길동   경영학과  경영학개론
1  이순신   교육학과  교육학개론
2  이순신   교육학과   상담심리
3  임꺽정  컴퓨터학과  프로그래밍
4  임꺽정  컴퓨터학과   운영체제
5  김유신   통계학과    확률론

In [ ]:
pd.merge(df1, df2, on='학생')

    학생     학과  입학년도
0  홍길동   경영학과  2012
1  이순신   교육학과  2016
2  임꺽정  컴퓨터학과  2019
3  김유신   통계학과  2020

In [ ]:
df6 = pd.DataFrame({'이름': ['홍길동', '이순신', '임꺽정', '김유신'],
                    '성적': ['A', 'A+', 'B', 'A+']})
df6

    이름  성적
0  홍길동   A
1  이순신  A+
2  임꺽정   B
3  김유신  A+

In [ ]:
pd.merge(df1, df6, left_on='학생', right_on = '이름')

    학생     학과   이름  성적
0  홍길동   경영학과  홍길동   A
1  이순신   교육학과  이순신  A+
2  임꺽정  컴퓨터학과  임꺽정   B
3  김유신   통계학과  김유신  A+

In [ ]:
pd.merge(df1, df6, left_on='학생', right_on = '이름').drop("이름", axis = 1)

    학생     학과  성적
0  홍길동   경영학과   A
1  이순신   교육학과  A+
2  임꺽정  컴퓨터학과   B
3  김유신   통계학과  A+

In [ ]:
mdf1 = df1.set_index('학생')
mdf2 = df2.set_index('학생')

In [ ]:
mdf1

        학과
학생
홍길동   경영학과
이순신   교육학과
임꺽정  컴퓨터학과
김유신   통계학과

In [ ]:
mdf2

     입학년도
학생
홍길동  2012
이순신  2016
임꺽정  2019
김유신  2020

In [ ]:
pd.merge(mdf1, mdf2, left_index=True, right_index=True)

        학과  입학년도
학생
홍길동   경영학과  2012
이순신   교육학과  2016
임꺽정  컴퓨터학과  2019
김유신   통계학과  2020

In [ ]:
mdf1.join(mdf2)

        학과  입학년도
학생
홍길동   경영학과  2012
이순신   교육학과  2016
임꺽정  컴퓨터학과  2019
김유신   통계학과  2020

In [ ]:
pd.merge(mdf1, df6, left_index=True, right_on='이름')

      학과   이름  성적
0   경영학과  홍길동   A
1   교육학과  이순신  A+
2  컴퓨터학과  임꺽정   B
3   통계학과  김유신  A+

In [ ]:
df7 = pd.DataFrame({'이름': ['홍길동', '이순신', '임꺽정'],
                    '주문음식': ['햄버거', '피자', '짜장면']})
df7

    이름 주문음식
0  홍길동  햄버거
1  이순신   피자
2  임꺽정  짜장면

In [ ]:
df8 = pd.DataFrame({'이름': ['홍길동', '이순신', '김유신'],
                    '주문음료': ['콜라', '사이다', '커피']})
df8

    이름 주문음료
0  홍길동   콜라
1  이순신  사이다
2  김유신   커피

In [ ]:
pd.merge(df7, df8) #둘다 이름이 있는 경우만 출력됨

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다

In [ ]:
pd.merge(df7, df8, how='inner') #default기 inner

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다

In [ ]:
pd.merge(df7, df8, how='outer')

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  임꺽정  짜장면  NaN
3  김유신  NaN   커피

In [ ]:
pd.merge(df7, df8, how='left') #df7에 있는 것만 기준으로

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  임꺽정  짜장면  NaN

In [ ]:
pd.merge(df7, df8, how='right') #df8에 있는 것만 기준으로

    이름 주문음식 주문음료
0  홍길동  햄버거   콜라
1  이순신   피자  사이다
2  김유신  NaN   커피

In [ ]:
df9 = pd.DataFrame({'이름': ['홍길동', '이순신', '임꺽정', '김유신'],
                    '순위': [3, 2, 4, 1]})
df9

    이름  순위
0  홍길동   3
1  이순신   2
2  임꺽정   4
3  김유신   1

In [ ]:
df10 = pd.DataFrame({'이름': ['홍길동', '이순신', '임꺽정', '김유신'],
                    '순위': [4, 1, 3, 2]})
df10

    이름  순위
0  홍길동   4
1  이순신   1
2  임꺽정   3
3  김유신   2

In [ ]:
pd.merge(df9, df10, on='이름')

    이름  순위_x  순위_y
0  홍길동     3     4
1  이순신     2     1
2  임꺽정     4     3
3  김유신     1     2

In [ ]:
pd.merge(df9, df10, on='이름', suffixes=['_인기', '_성적'])

    이름  순위_인기  순위_성적
0  홍길동      3      4
1  이순신      2      1
2  임꺽정      4      3
3  김유신      1      2

## 데이터 집계와 그룹 연산
|집계|설명|
|---|---|
|count| 전체 개수|
|head, tail| 앞의 항목 일부 반환, 뒤의 항목 일부 반환|
|describe|Series, DataFrame의 각 컬럼에 대한 요약 통계|
|min, max|최소값, 최대값|
|cummin, cummax| 누적 최소값, 누적 최대값|
|idxmin, idxmax| 최소값과 최대값의 색인값|
|mean, median|평균값, 중앙값|
|std, var|표준편자(Standard Deviation), 분산(Variance)|
|skew|왜도(skewnes)값 계산|
|kurt|첨도(kurtosis)값 계산|
|mad|절대 평균 편자(Mean Absolute Deviation)|
|sum, cumsum|전체 항목 합, 누적합|
|prod, cumprod|전체 항목 곱, 누적곱|
|quantile|0부터 1까지의 분위수 게산|
|diff|1차 산술차 계산|
|pct_change|펴센트 변화율 계산|
|corr, cov|상관관계, 공분산 계산|

#### 집계 연산(Aggregation)

In [ ]:
df = pd.DataFrame([[1, 1.2, np.nan],
                   [2.4, 5.5, 4.2],
                   [np.nan, np.nan, np.nan],
                   [0.44, -3.1, -4.1]],
                   index=[1, 2, 3, 4],
                   columns=['A', 'B', 'C'])
df

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

In [ ]:
df.head(2)

     A    B    C
1  1.0  1.2  NaN
2  2.4  5.5  4.2

In [ ]:
df.tail(2)

      A    B    C
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

In [ ]:
df.describe() #요약된 통계값 표시

              A     B         C
count  3.000000  3.00  2.000000
mean   1.280000  1.20  0.050000
std    1.009554  4.30  5.868986
min    0.440000 -3.10 -4.100000
25%    0.720000 -0.95 -2.025000
50%    1.000000  1.20  0.050000
75%    1.700000  3.35  2.125000
max    2.400000  5.50  4.200000

In [ ]:
print(df, "\n")
print(np.argmin(df), "\n")
print(np.argmax(df), "\n")

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

2

2

In [ ]:
print(df, "\n")
print(df.idxmin(),"\n")
print(df.idxmax(), "\n")

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

A    4
B    4
C    4
dtype: int64

A    2
B    2
C    2
dtype: int64

In [ ]:
print(df, "\n")
print(df.std(), "\n")
print(df.var(), "\n")

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

A    1.009554
B    4.300000
C    5.868986
dtype: float64

A     1.0192
B    18.4900
C    34.4450
dtype: float64

In [ ]:
print(df, "\n")
print(df.skew(), "\n")
print(df.kurt(), "\n")

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

A    1.15207
B    0.00000
C        NaN
dtype: float64

A   NaN
B   NaN
C   NaN
dtype: float64

In [ ]:
print(df, "\n")
print(df.sum(), "\n")
print(df.cumsum(), "\n")

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

A    3.84
B    3.60
C    0.10
dtype: float64

      A    B    C
1  1.00  1.2  NaN
2  3.40  6.7  4.2
3   NaN  NaN  NaN
4  3.84  3.6  0.1

In [ ]:
print(df, "\n")
print(df.prod(), "\n")
print(df.cumprod(), "\n")

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

A     1.056
B   -20.460
C   -17.220
dtype: float64

       A      B      C
1  1.000   1.20    NaN
2  2.400   6.60   4.20
3    NaN    NaN    NaN
4  1.056 -20.46 -17.22

In [ ]:
df.diff()

     A    B   C
1  NaN  NaN NaN
2  1.4  4.3 NaN
3  NaN  NaN NaN
4  NaN  NaN NaN

In [ ]:
df.quantile()

A    1.00
B    1.20
C    0.05
Name: 0.5, dtype: float64

In [ ]:
df.pct_change()

          A         B        C
1       NaN       NaN      NaN
2  1.400000  3.583333      NaN
3  0.000000  0.000000  0.00000
4 -0.816667 -1.563636 -1.97619

In [ ]:
df.corr()

          A         B    C
A  1.000000  0.970725  1.0
B  0.970725  1.000000  1.0
C  1.000000  1.000000  1.0

In [ ]:
df.corrwith(df.B) #B값을 기준으로 corrilation 상태를 보겠다.

A    0.970725
B    1.000000
C    1.000000
dtype: float64

In [ ]:
df.cov()

        A       B       C
A  1.0192   4.214   8.134
B  4.2140  18.490  35.690
C  8.1340  35.690  34.445

In [ ]:
df['B'].unique()

array([ 1.2,  5.5,  nan, -3.1])

In [ ]:
df['A'].value_counts()

0.44    1
2.40    1
1.00    1
Name: A, dtype: int64

### GroupBy 연산

In [ ]:
df = pd.DataFrame({'c1': ['a', 'a', 'b', 'b', 'c', 'd', 'b'],
                   'c2': ['A', 'B', 'B', 'A', 'D', 'C', 'C'],
                   'c3': np.random.randint(7),
                   'c4': np.random.random(7)})
df

  c1 c2  c3        c4
0  a  A   4  0.662315
1  a  B   4  0.121753
2  b  B   4  0.524932
3  b  A   4  0.569011
4  c  D   4  0.409321
5  d  C   4  0.040779
6  b  C   4  0.106784

In [ ]:
df.dtypes

c1     object
c2     object
c3      int64
c4    float64
dtype: object

In [ ]:
df['c3'].groupby(df['c1']).mean()

c1
a    4
b    4
c    4
d    4
Name: c3, dtype: int64

In [ ]:
df['c4'].groupby(df['c2']).std()

c2
A    0.065976
B    0.285090
C    0.046672
D         NaN
Name: c4, dtype: float64

In [ ]:
df['c4'].groupby([df['c1'], df['c2']]).mean() #Series 형태

c1  c2
a   A     0.662315
    B     0.121753
b   A     0.569011
    B     0.524932
    C     0.106784
c   D     0.409321
d   C     0.040779
Name: c4, dtype: float64

In [ ]:
df['c4'].groupby([df['c1'], df['c2']]).mean().unstack() #DataFrame형태

c2         A         B         C         D
c1
a   0.662315  0.121753       NaN       NaN
b   0.569011  0.524932  0.106784       NaN
c        NaN       NaN       NaN  0.409321
d        NaN       NaN  0.040779       NaN

In [ ]:
df.groupby('c1').mean() #전체를 다 할 때

    c3        c4
c1
a    4  0.392034
b    4  0.400242
c    4  0.409321
d    4  0.040779

In [ ]:
df.groupby(['c1', 'c2']).mean()

       c3        c4
c1 c2
a  A    4  0.662315
   B    4  0.121753
b  A    4  0.569011
   B    4  0.524932
   C    4  0.106784
c  D    4  0.409321
d  C    4  0.040779

In [ ]:
df.groupby(['c1', 'c2']).size()

c1  c2
a   A     1
    B     1
b   A     1
    B     1
    C     1
c   D     1
d   C     1
dtype: int64

In [ ]:
for c1, group in df.groupby('c1'):
  print(c1)
  print(group)
###for

a
  c1 c2  c3        c4
0  a  A   4  0.662315
1  a  B   4  0.121753
b
  c1 c2  c3        c4
2  b  B   4  0.524932
3  b  A   4  0.569011
6  b  C   4  0.106784
c
  c1 c2  c3        c4
4  c  D   4  0.409321
d
  c1 c2  c3        c4
5  d  C   4  0.040779

In [ ]:
for (c1, c2), group in df.groupby(['c1', 'c2']):
  print((c1, c2))
  print(group)
###for

('a', 'A')
  c1 c2  c3        c4
0  a  A   4  0.662315
('a', 'B')
  c1 c2  c3        c4
1  a  B   4  0.121753
('b', 'A')
  c1 c2  c3        c4
3  b  A   4  0.569011
('b', 'B')
  c1 c2  c3        c4
2  b  B   4  0.524932
('b', 'C')
  c1 c2  c3        c4
6  b  C   4  0.106784
('c', 'D')
  c1 c2  c3        c4
4  c  D   4  0.409321
('d', 'C')
  c1 c2  c3        c4
5  d  C   4  0.040779

In [ ]:
df.groupby(['c1', 'c2'])[['c4']].mean() #c1, c2를 기준으로하고, c4에 대한 mean값만 출력

             c4
c1 c2
a  A   0.662315
   B   0.121753
b  A   0.569011
   B   0.524932
   C   0.106784
c  D   0.409321
d  C   0.040779

In [ ]:
df.groupby('c1')['c3'].quantile()

c1
a    4.0
b    4.0
c    4.0
d    4.0
Name: c3, dtype: float64

In [ ]:
df.groupby('c1')['c3'].count()

c1
a    2
b    3
c    1
d    1
Name: c3, dtype: int64

In [ ]:
df.groupby('c1')['c4'].median()

c1
a    0.392034
b    0.524932
c    0.409321
d    0.040779
Name: c4, dtype: float64

In [ ]:
df.groupby('c1')['c4'].std()

c1
a    0.382235
b    0.255096
c         NaN
d         NaN
Name: c4, dtype: float64

In [ ]:
df.groupby('c1')['c4'].std()

In [ ]:
df.groupby(['c1', 'c2'])['c4'].agg(['mean', 'min', 'max'])

           mean       min       max
c1 c2
a  A   0.662315  0.662315  0.662315
   B   0.121753  0.121753  0.121753
b  A   0.569011  0.569011  0.569011
   B   0.524932  0.524932  0.524932
   C   0.106784  0.106784  0.106784
c  D   0.409321  0.409321  0.409321
d  C   0.040779  0.040779  0.040779

In [ ]:
df.groupby(['c1', 'c2'], as_index=False)['c4'].mean() #index가 보임

  c1 c2        c4
0  a  A  0.662315
1  a  B  0.121753
2  b  A  0.569011
3  b  B  0.524932
4  b  C  0.106784
5  c  D  0.409321
6  d  C  0.040779

In [ ]:
df.groupby(['c1', 'c2'], group_keys=False)['c4'].mean()

c1  c2
a   A     0.662315
    B     0.121753
b   A     0.569011
    B     0.524932
    C     0.106784
c   D     0.409321
d   C     0.040779
Name: c4, dtype: float64

In [ ]:
def topn(df, n=3, column='c1'): #내가 원하는 집계함수 만들어서 사용도 가능
  return df.sort_values(by=column)[-n:]
###def

In [ ]:
topn(df, n=5)

  c1 c2  c3        c4
2  b  B   4  0.524932
3  b  A   4  0.569011
6  b  C   4  0.106784
4  c  D   4  0.409321
5  d  C   4  0.040779

In [ ]:
df.groupby('c1').apply(topn) #만들어진 집계함수를 적용하도록

     c1 c2  c3        c4
c1
a  0  a  A   4  0.662315
   1  a  B   4  0.121753
b  2  b  B   4  0.524932
   3  b  A   4  0.569011
   6  b  C   4  0.106784
c  4  c  D   4  0.409321
d  5  d  C   4  0.040779

### 피벗 테이블(Pivot Table)
|함수|설명|
|---|---|
|values|집계하려는 컬럼 이름 혹은 이름의 리스트, 기본적으로 모든 숫자 컬럼 집계|
|index|피벗테이블의 로우를 그룹으로 묶을 컬럼 이름이나 그룹 키|
|columns|피벗테이블의 컬럼을 그룹으로 묶을 컬림 이름이나 그룹 키|
|aggfunc|집계 함수나 함수 리스트. 기본값으로 mean이 사용|
|fill_value|결과 테이블에서 누락된 값 대체를 위한 값|
|dropna|True인 경우 모든 항목이 NA인 컬럼은 포함되지 않음|
|margins|부분합이나 총계를 담기 위한 로우/컬럼 추가 여부. 기본값은 False|

In [ ]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'])

     c3                       c4
c2    A    B    C    D         A         B         C         D
c1
a   4.0  4.0  NaN  NaN  0.662315  0.121753       NaN       NaN
b   4.0  4.0  4.0  NaN  0.569011  0.524932  0.106784       NaN
c   NaN  NaN  NaN  4.0       NaN       NaN       NaN  0.409321
d   NaN  NaN  4.0  NaN       NaN       NaN  0.040779       NaN

In [ ]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True) #끝에 부분합 총계인 "All"이 추가됨

      c3                           c4
c2     A    B    C    D All         A         B         C         D       All
c1
a    4.0  4.0  NaN  NaN   4  0.662315  0.121753       NaN       NaN  0.392034
b    4.0  4.0  4.0  NaN   4  0.569011  0.524932  0.106784       NaN  0.400242
c    NaN  NaN  NaN  4.0   4       NaN       NaN       NaN  0.409321  0.409321
d    NaN  NaN  4.0  NaN   4       NaN       NaN  0.040779       NaN  0.040779
All  4.0  4.0  4.0  4.0   4  0.615663  0.323342  0.073781  0.409321  0.347842

In [ ]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True,
               aggfunc=sum) #집계함수 지정

      c3                           c4
c2     A    B    C    D All         A         B         C         D       All
c1
a    4.0  4.0  NaN  NaN   8  0.662315  0.121753       NaN       NaN  0.784068
b    4.0  4.0  4.0  NaN  12  0.569011  0.524932  0.106784       NaN  1.200726
c    NaN  NaN  NaN  4.0   4       NaN       NaN       NaN  0.409321  0.409321
d    NaN  NaN  4.0  NaN   4       NaN       NaN  0.040779       NaN  0.040779
All  8.0  8.0  8.0  4.0  28  1.231326  0.646684  0.147563  0.409321  2.434894

In [ ]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True,
               aggfunc=sum,
               fill_value=0) #NaN을 0으로 채움

    c3                     c4
c2   A  B  C  D All         A         B         C         D       All
c1
a    4  4  0  0   8  0.662315  0.121753  0.000000  0.000000  0.784068
b    4  4  4  0  12  0.569011  0.524932  0.106784  0.000000  1.200726
c    0  0  0  4   4  0.000000  0.000000  0.000000  0.409321  0.409321
d    0  0  4  0   4  0.000000  0.000000  0.040779  0.000000  0.040779
All  8  8  8  4  28  1.231326  0.646684  0.147563  0.409321  2.434894

In [ ]:
pd.crosstab(df.c1, df.c2)

c2  A  B  C  D
c1
a   1  1  0  0
b   1  1  1  0
c   0  0  0  1
d   0  0  1  0

In [ ]:
pd.crosstab(df.c1, df.c2, values=df.c3, aggfunc=sum, margins=True) #피벗데이블과 비슷한 기능

c2     A    B    C    D  All
c1
a    4.0  4.0  NaN  NaN    8
b    4.0  4.0  4.0  NaN   12
c    NaN  NaN  NaN  4.0    4
d    NaN  NaN  4.0  NaN    4
All  8.0  8.0  8.0  4.0   28

### 범주형(Categorical) 데이터
|메소드|설명|
|---|---|
|add_categories|기존 카테고리에 새로운 카테고리 추가|
|as_ordered|카테고리 순서 지정|
|as_unordered|카테고리 순서 미지정|
|remove_categories|카테고리 제거|
|remove_unused_categories|사용않하는 카테고리 제거|
|rename_categories|카테고리 이름 변경|
|reorder_categories|새로운 카테고리에 순서 지정|
|set_categories|새로운 카테고리로 변경|

In [ ]:
s = pd.Series(['c1', 'c2', 'c1', 'c2', 'c1'] * 2)
s

0    c1
1    c2
2    c1
3    c2
4    c1
5    c1
6    c2
7    c1
8    c2
9    c1
dtype: object

In [ ]:
pd.unique(s)

array(['c1', 'c2'], dtype=object)

In [ ]:
pd.value_counts(s)

c1    6
c2    4
dtype: int64

In [ ]:
code = pd.Series([0,1,0,1,0] * 2)
code

0    0
1    1
2    0
3    1
4    0
5    0
6    1
7    0
8    1
9    0
dtype: int64

In [ ]:
d = pd.Series(['c1', 'c2'])
d

0    c1
1    c2
dtype: object

In [ ]:
d.take(code)

0    c1
1    c2
0    c1
1    c2
0    c1
0    c1
1    c2
0    c1
1    c2
0    c1
dtype: object

In [ ]:
df = pd.DataFrame({'id': np.arange(len(s)),
                  'c': s,
                  'v': np.random.randint(1000, 5000, size=len(s))})
df

   id   c     v
0   0  c1  4201
1   1  c2  4909
2   2  c1  1644
3   3  c2  2626
4   4  c1  2945
5   5  c1  2044
6   6  c2  3022
7   7  c1  4403
8   8  c2  4868
9   9  c1  3779

In [ ]:
c = df['c'].astype('category') #df에 있는 'c'라는 걸럼은 카타고리야
c

0    c1
1    c2
2    c1
3    c2
4    c1
5    c1
6    c2
7    c1
8    c2
9    c1
Name: c, dtype: category
Categories (2, object): ['c1', 'c2']

In [ ]:
c.values

['c1', 'c2', 'c1', 'c2', 'c1', 'c1', 'c2', 'c1', 'c2', 'c1']
Categories (2, object): ['c1', 'c2']

In [ ]:
c.values.categories

Index(['c1', 'c2'], dtype='object')

In [ ]:
c.values.codes

array([0, 1, 0, 1, 0, 0, 1, 0, 1, 0], dtype=int8)

In [ ]:
df['c'] = c
df.c

0    c1
1    c2
2    c1
3    c2
4    c1
5    c1
6    c2
7    c1
8    c2
9    c1
Name: c, dtype: category
Categories (2, object): ['c1', 'c2']

In [ ]:
c = pd.Categorical(['c1', 'c2', 'c1', 'c2'])
c

['c1', 'c2', 'c1', 'c2']
Categories (2, object): ['c1', 'c2']

In [ ]:
categories = ['c1', 'c2', 'c3']
codes =[0, 1, 2, 0, 1]
c = pd.Categorical.from_codes(codes=codes, categories=categories)
c

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1', 'c2', 'c3']

In [ ]:
pd.Categorical.from_codes(codes=codes, categories=categories, ordered=True)

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1' < 'c2' < 'c3']

In [ ]:
c.as_ordered()

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1' < 'c2' < 'c3']

In [ ]:
c.codes

array([0, 1, 2, 0, 1], dtype=int8)

In [ ]:
c.categories

Index(['c1', 'c2', 'c3'], dtype='object')

In [ ]:
c = c.set_categories(['c1', 'c2', 'c3', 'c4', 'c5'])
c.categories

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

In [ ]:
c.value_counts()

c1    2
c2    2
c3    1
c4    0
c5    0
dtype: int64

In [ ]:
c[c.isin(['c1', 'c3'])]

['c1', 'c3', 'c1']
Categories (5, object): ['c1', 'c2', 'c3', 'c4', 'c5']

In [ ]:
c = c.remove_unused_categories() #c4, c5등 사용하지 않는 category 제거

In [ ]:
c.categories

Index(['c1', 'c2', 'c3'], dtype='object')

## 문자열 연산

#### 문자열 연산자
* 기존 파이썬의 문자열 연산자를 거의 모두 반영
* pd.Series객체로 전환 후 str.함수()방식으로 모두 사용가능

|함수|설명|
|---|---|
|capitalize()|첫 문자를 대문자로하고, 나머지 문자들 소문자로 하는 문자열 반환|
|caseflod()|모든 대소문자 구분을 제거|
|count(sub, [, start[, end]])|[start, end]범위에서 부분 문자열 sub의 중복되지 앟는 수를 반환|
|find(sub, [, start[, end]])|[start, end]에서 부분 문자열 sub가 문자열의 가장 작은 인덱스를 반환, sub가 발견되지 않는 경우는 -1 반환|
|rfind(sub, [, start[, end]])|[start, end]에서 부분 문자열 sub가 가장 큰 인덱스를 반환, sub가 발견되지 않는 경우는 -1 반환|
|index(sub, [, start[, end]])|find()와 유사하지만 부분 문자열 sub가 없으면 ValueError 발생|
|rindex(sub, [, start[, end]])|rfind()와 유사하지만 부분 문자열 sub가 없으면 ValueError 발생|
|isalnum()|문자열의 모든 문자가 영숫자가 1개 이상 있으면 True, 아니면 False 반환|
|isalpha()|문자열의 모든 문자가 영문자가 1개 이상 있으면 True, 아니면 False 반환|
|isdecimal()|문자열의 모든 문자가 10진수 문자이며 1개 이상 있을 때 True, 그렇지 않으면 False반환|
|isdigit()|문자열의 모든 문자가 숫자이며 1개 이상 있을 대 True, 그럼지 않으면 False반환|
|isnumerical()|문자열의 모든 문자가 수치형이며 1개 이상 있을 때 True, 그렇지 않으면 False반환|
|isidentifier()|문자열이 유효한 식별자인 경우 True반환|
|isspace()|문자열 내에 공백문자가 있고, 문자가 1개 이상 있으면 True, 그렇지 않으면 False|
|istitle()|문자열이 제목이 있는 문자열에 문자가 1개 이상 있으면 True, 그렇지 않으면 False|
|islower()|문자열의 모든 문자가 소문자이며 1개 이상 있을 때 True, 그렇지 않으면 False 반환|
|isupper()|문자열의 모든 문자가 대문자이며 1개 이상 있을 때 True, 그렇지 않으면 False 반환|
|join(iterable)|iterable에 있는 문자열에 연결된 문자열을 반환|
|center(width, [, fillchar])|길이 너비만큼 중앙정렬된 문자열 반환|
|ljust(width, [, fillchar])|너비만큼의 문자열에서 왼쪽 정렬된 문자열을 반환|
|rjust(width, [, fillchar])|너비만큼의 문자열에서 오른쪽 정렬된 문자열을 반환|
|lower()|모든 대소문자가 소문자로 변환된 문자열을 반환|
|upper()|문자열에서 모든 문자를 대문자로 변환한 문자열을 반환|
|swapcase()|문자열에서 소문자를 대문자로 대문자를 소문자로 변환한 문자열 반환|
|strip([chars])|문자열 양쪽에 지정된 chars 또는 공백을 제거한 문자열을 반환|
|lstrip([chars])|문자열 왼쪽에 지정된 chars 또는 공백을 제거한 문자열을 반환|
|rstrip([chars])|문자열 오른쪽에 지정된 chars 또는 공백을 제거한 문자열을 반환|
|partition(sep)|문자열에서 첫번째 sep를 기준으로 분할하여 3개의 튜플을 반환|
|rpartition(sep)|문자열에서 마지막 sep를 기준으로 분할하여 3개의 튜플을 반환|
|replace(old, new[,count])|문자열의 모든 old를 new로 교체한 문자열을 반환|
|split(sep=None, maxsplit=1|앞에서 부터 sep를 구분자 문자열로 사용하여 무자열의 단어 목록을 반환|
|rsplit(sep=None, maxsplit=1|뒈이서 부터 sep를 구분자 문자열로 사용하여 무자열의 단어 목록을 반환|
|splitlines([keepends]|문자열에서 라인 단위로 구분하여 리스트를 반환|
|startswitch(prefix [, start[, end]])|[start, end] 범위에서 지정한 prefix로 시작하여 True, 아니면 False 반환|
|endswitch(suffix [, start[, end]])|[sart, end] 범위에서 지정한 suffix로 끝나면 True, 아니면 False 반환|
|zfill(width|너비 만큼의 문자열에서 비어있는 부분에 '0'이 채워진 문자열 반환|

In [4]:
name_tuple = ["Moon-Kee Bahk", 'Steven Jobs', 'Larry Page', 'Elon Musk', None, "Bill Gates", 'Mark Zuckerberg', 'Jeff Bezon']
names = pd.Series(name_tuple)
names

0      Moon-Kee Bahk
1        Steven Jobs
2         Larry Page
3          Elon Musk
4               None
5         Bill Gates
6    Mark Zuckerberg
7         Jeff Bezon
dtype: object

In [5]:
names.str.lower()

0      moon-kee bahk
1        steven jobs
2         larry page
3          elon musk
4               None
5         bill gates
6    mark zuckerberg
7         jeff bezon
dtype: object

In [6]:
names.str.len()

0    13.0
1    11.0
2    10.0
3     9.0
4     NaN
5    10.0
6    15.0
7    10.0
dtype: float64

In [7]:
names.str.split()

0      [Moon-Kee, Bahk]
1        [Steven, Jobs]
2         [Larry, Page]
3          [Elon, Musk]
4                  None
5         [Bill, Gates]
6    [Mark, Zuckerberg]
7         [Jeff, Bezon]
dtype: object

#### 기타 연산자
|메소드|설명|
|---|---|
|get()|각 요소에 인덱스 지정|
|slice()|각 요소에 슬라이스 적용|
|slice_replace()|각 요소의 슬라이스를 특정 값으로 대체|
|cat()|문자열 연결|
|repeat()|값 반복|
|normalize()|문자열의 유니코드 형태로 반환|
|pad()|문자열 왼쪽, 오른쪽, 또는 양쪽 공백추가|
|wrap()|긴 문자열을 주어진 너비보다 짧은 길이의 여러 줄로 나눔|
|join()|Series의 각 요소에 있는 문자열을 전달된 구분자와 결합|
|get_dummies()|DataFrame으로 가빈수(dummy variable) 추룰|

In [8]:
names.str[0:4]

0    Moon
1    Stev
2    Larr
3    Elon
4    None
5    Bill
6    Mark
7    Jeff
dtype: object

In [9]:
names.str.split().str.get(-1)

0          Bahk
1          Jobs
2          Page
3          Musk
4          None
5         Gates
6    Zuckerberg
7         Bezon
dtype: object

In [10]:
names.str.repeat(2)

0        Moon-Kee BahkMoon-Kee Bahk
1            Steven JobsSteven Jobs
2              Larry PageLarry Page
3                Elon MuskElon Musk
4                              None
5              Bill GatesBill Gates
6    Mark ZuckerbergMark Zuckerberg
7              Jeff BezonJeff Bezon
dtype: object

In [11]:
names.str.join('*')

0        M*o*o*n*-*K*e*e* *B*a*h*k
1            S*t*e*v*e*n* *J*o*b*s
2              L*a*r*r*y* *P*a*g*e
3                E*l*o*n* *M*u*s*k
4                             None
5              B*i*l*l* *G*a*t*e*s
6    M*a*r*k* *Z*u*c*k*e*r*b*e*r*g
7              J*e*f*f* *B*e*z*o*n
dtype: object

#### 정규표현식
|메소드|설명|
|---|---|
|match()|각 요소에 re.match()호출. 불리언 값 반환|
|extract()|각 요소에 re.match()호출. 문자열로 매칭된 그룹 반환|
|findall()|각 요소에 re.findall()호출|
|replace()|패턴이 발행한 곳을 다른 문자열로 대체|
|contains()|각 요소에 re.search() 호출, 불리언 값 반환|
|count()|패턴 발생 건수 집계|
|split()|str.split()과 동일하지만 정규 표현식 사용|
|rsplit()|str.rsplit()과 동일하지만 정규 표현식 사용|

In [13]:
names.str.match('([A-Za-z]+)') #전체가 알파벳인 경우 True로 뜨기

0    True
1    True
2    True
3    True
4    None
5    True
6    True
7    True
dtype: object

In [15]:
names.str.findall('([A-Za-z]+)')

0     [Moon, Kee, Bahk]
1        [Steven, Jobs]
2         [Larry, Page]
3          [Elon, Musk]
4                  None
5         [Bill, Gates]
6    [Mark, Zuckerberg]
7         [Jeff, Bezon]
dtype: object

## 시계열 처리
* 판다스가 금융쪽에 사용되면서 시계열 데이타처리에 특화가 되어 있음

In [16]:
idx = pd.DatetimeIndex(['2019-01-01', '2020-01-01', '2020-02-01', '2020-02-02', '2020-03-01'])
s = pd.Series([0, 1, 2, 3, 4], index=idx)
s

2019-01-01    0
2020-01-01    1
2020-02-01    2
2020-02-02    3
2020-03-01    4
dtype: int64

In [17]:
s['2020-01-01':] #슬라이싱 가능, 2020년01월01일 이후

2020-01-01    1
2020-02-01    2
2020-02-02    3
2020-03-01    4
dtype: int64

In [18]:
s[:'2020-01-01']

2019-01-01    0
2020-01-01    1
dtype: int64

In [20]:
s['2019'] #날짜로 되어있어 2019년만 보여줘 같은 것이 가능, 날짜 자체가 계층적 인덱싱을 가지기 때문임

2019-01-01    0
dtype: int64

#### 시계열 데이터 구조
|타임스탬프(timestamp)|기간(time period)|시간델타 또는 지속 기간|
|---|---|---|
|Pandas Timestamp 타입 제공|Pandas Period 타입 제공|Pandas의 Timedelta 타입 제공|
|Python datatime 대체 타입||Python datetime.timedelta 대체 타입|
|numpy.datatime64 타입 기반|numpy.datatime64 타입기반|numpy.timedelta64 타입 기반|
|DatatimeIndex 인덱스 구조|PeriodIndex 인덱스 구조|TimedeltaIndex 인덱스 구조|

In [22]:
from datetime import datetime
dates = pd.to_datetime(['12-12-2019', datetime(2020, 1, 1), '2nd of Feb, 2020', '2020-Mar-4', '20200701'])
dates

DatetimeIndex(['2019-12-12', '2020-01-01', '2020-02-02', '2020-03-04',
               '2020-07-01'],
              dtype='datetime64[ns]', freq=None)

In [23]:
dates.to_period('D')

PeriodIndex(['2019-12-12', '2020-01-01', '2020-02-02', '2020-03-04',
             '2020-07-01'],
            dtype='period[D]', freq='D')

In [24]:
dates - dates[0]

TimedeltaIndex(['0 days', '20 days', '52 days', '83 days', '202 days'], dtype='timedelta64[ns]', freq=None)

In [26]:
pd.date_range('2020-01-01', '2020-07-01')

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2020-06-22', '2020-06-23', '2020-06-24', '2020-06-25',
               '2020-06-26', '2020-06-27', '2020-06-28', '2020-06-29',
               '2020-06-30', '2020-07-01'],
              dtype='datetime64[ns]', length=183, freq='D')

In [27]:
pd.date_range('2020-01-01', periods=7)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07'],
              dtype='datetime64[ns]', freq='D')

In [28]:
pd.date_range('2020-01-01', periods=7, freq='M')

DatetimeIndex(['2020-01-31', '2020-02-29', '2020-03-31', '2020-04-30',
               '2020-05-31', '2020-06-30', '2020-07-31'],
              dtype='datetime64[ns]', freq='M')

In [29]:
pd.date_range('2020-01-01', periods=7, freq='H')

DatetimeIndex(['2020-01-01 00:00:00', '2020-01-01 01:00:00',
               '2020-01-01 02:00:00', '2020-01-01 03:00:00',
               '2020-01-01 04:00:00', '2020-01-01 05:00:00',
               '2020-01-01 06:00:00'],
              dtype='datetime64[ns]', freq='H')

In [32]:
idx = pd.to_datetime(['2020-01-01 12:00:00', '2020-01-02 00:00:00'] + [None])
idx #아무것도 없는 값은 NaT(Not a Time)로 저장

DatetimeIndex(['2020-01-01 12:00:00', '2020-01-02 00:00:00', 'NaT'], dtype='datetime64[ns]', freq=None)

In [33]:
idx[2]

NaT

In [34]:
pd.isnull(idx)

array([False, False,  True])

### 시계열 기본

In [35]:
dates = [datetime(2020, 1, 1), datetime(2020, 1, 2), datetime(2020, 1, 4), datetime(2020, 1, 7),
         datetime(2020, 1, 10), datetime(2020, 1, 11), datetime(2020, 1, 15)]
dates

[datetime.datetime(2020, 1, 1, 0, 0),
 datetime.datetime(2020, 1, 2, 0, 0),
 datetime.datetime(2020, 1, 4, 0, 0),
 datetime.datetime(2020, 1, 7, 0, 0),
 datetime.datetime(2020, 1, 10, 0, 0),
 datetime.datetime(2020, 1, 11, 0, 0),
 datetime.datetime(2020, 1, 15, 0, 0)]

In [36]:
ts = pd.Series(np.random.randn(7), index=dates)
ts

2020-01-01    0.197378
2020-01-02   -1.511149
2020-01-04    0.007201
2020-01-07    1.040940
2020-01-10    0.923364
2020-01-11    0.384292
2020-01-15   -1.275419
dtype: float64

In [37]:
ts.index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-04', '2020-01-07',
               '2020-01-10', '2020-01-11', '2020-01-15'],
              dtype='datetime64[ns]', freq=None)

In [38]:
ts.index[0]

Timestamp('2020-01-01 00:00:00')

In [39]:
ts[ts.index[2]]

0.007201162171209062

In [40]:
ts['20200104']

0.007201162171209062

In [41]:
ts['1/4/2020'] #모든 문자열 파싱을 변환해서 사용가능

0.007201162171209062

In [43]:
ts = pd.Series(np.random.randn(1000),
               index=pd.date_range('2017-10-01', periods=1000))
ts

2017-10-01   -0.164403
2017-10-02   -1.297767
2017-10-03    1.282969
2017-10-04    0.166246
2017-10-05    2.343731
                ...
2020-06-22   -0.187321
2020-06-23   -0.068571
2020-06-24    1.365917
2020-06-25    1.775014
2020-06-26   -1.140324
Freq: D, Length: 1000, dtype: float64

In [45]:
ts['2020'] #1000개 중에서 2020년만 축약해서 보여줌

2020-01-01    0.880742
2020-01-02    2.773011
2020-01-03    0.930842
2020-01-04    0.676028
2020-01-05   -0.416530
                ...
2020-06-22   -0.187321
2020-06-23   -0.068571
2020-06-24    1.365917
2020-06-25    1.775014
2020-06-26   -1.140324
Freq: D, Length: 178, dtype: float64

In [46]:
ts['2020-06']

2020-06-01   -1.158596
2020-06-02   -0.443497
2020-06-03    1.609435
2020-06-04    0.483824
2020-06-05   -0.101569
2020-06-06    1.257310
2020-06-07   -0.605272
2020-06-08    0.124406
2020-06-09   -0.168747
2020-06-10    1.166204
2020-06-11    1.247049
2020-06-12   -0.522015
2020-06-13   -1.013404
2020-06-14    0.192856
2020-06-15    0.132079
2020-06-16    0.414042
2020-06-17    1.912944
2020-06-18   -0.576127
2020-06-19    1.527301
2020-06-20    0.343137
2020-06-21   -0.762872
2020-06-22   -0.187321
2020-06-23   -0.068571
2020-06-24    1.365917
2020-06-25    1.775014
2020-06-26   -1.140324
Freq: D, dtype: float64

In [48]:
ts[datetime(2020, 6, 20)]

0.34313748774431274

In [50]:
ts['2020-06-10':'2020-06-20'] #슬라이싱 가능

2020-06-10    1.166204
2020-06-11    1.247049
2020-06-12   -0.522015
2020-06-13   -1.013404
2020-06-14    0.192856
2020-06-15    0.132079
2020-06-16    0.414042
2020-06-17    1.912944
2020-06-18   -0.576127
2020-06-19    1.527301
2020-06-20    0.343137
Freq: D, dtype: float64

In [53]:
tdf = pd.DataFrame(np.random.randn(1000, 4),
                   index=pd.date_range('2017-01-01', periods=1000),
                   columns=['A', 'B', 'C', 'D'])
tdf

                   A         B         C         D
2017-01-01  0.783404  0.513176  1.610138 -0.308497
2017-01-02 -0.636320 -0.441349 -0.080417 -0.504609
2017-01-03 -0.058293  0.348611 -1.521566  0.754043
2017-01-04 -1.237916  0.916311  0.420017  0.384691
2017-01-05  0.087637  1.951665 -2.549659 -0.306594
...              ...       ...       ...       ...
2019-09-23  0.520572  0.695328  0.262088  1.214833
2019-09-24  0.276925 -0.239720 -0.299392 -0.010030
2019-09-25 -0.180985  0.024840  0.872439  0.491288
2019-09-26 -0.100246  0.833274 -1.565180  0.011071
2019-09-27 -1.303524  0.089255  1.002013  0.136545

[1000 rows x 4 columns]

In [55]:
tdf['2019']

                   A         B         C         D
2019-01-01  1.052755 -1.025055 -1.130643  0.522363
2019-01-02  2.078788  1.442238  0.535209 -1.260136
2019-01-03  0.249753  1.192881 -0.865507 -0.607988
2019-01-04 -0.812083 -1.506304 -0.372979 -0.319400
2019-01-05 -2.097265 -0.053055  1.479514  0.484606
...              ...       ...       ...       ...
2019-09-23  0.520572  0.695328  0.262088  1.214833
2019-09-24  0.276925 -0.239720 -0.299392 -0.010030
2019-09-25 -0.180985  0.024840  0.872439  0.491288
2019-09-26 -0.100246  0.833274 -1.565180  0.011071
2019-09-27 -1.303524  0.089255  1.002013  0.136545

[270 rows x 4 columns]

In [56]:
tdf.loc['2019-06']

                   A         B         C         D
2019-06-01  2.279713 -0.243475  1.308808 -2.673610
2019-06-02  0.657285  0.418222 -1.247299  0.160415
2019-06-03  2.192474  0.612850  0.123952 -0.906654
2019-06-04 -1.595100 -1.419719  1.297019 -0.178459
2019-06-05 -0.109006 -0.625867  1.157965 -0.879280
2019-06-06  0.026373  0.105203 -2.388984  1.190162
2019-06-07 -0.588157  1.474806  1.235499 -0.837673
2019-06-08  0.759959 -0.072871  0.103664  0.930167
2019-06-09  1.230355 -0.082508 -1.215310 -0.793132
2019-06-10  0.903106  0.758785  1.486533  1.089728
2019-06-11  1.002199  1.640646  1.015711  1.136513
2019-06-12  0.707611  1.115242 -1.613364  0.232001
2019-06-13 -0.152125 -1.666073 -0.002635  0.045060
2019-06-14  0.193675 -0.482536 -0.542587 -0.683505
2019-06-15  2.276571 -0.063933 -1.490732 -2.184450
2019-06-16  0.071471 -1.136282 -0.664571 -0.206631
2019-06-17  1.324089 -1.682415 -1.164457  1.492792
2019-06-18 -0.788469  1.342886 -0.282217  0.771699
2019-06-19 -0.650291 -0.093295  0.790070 -0.754274
2019-06-20  1.296115  1.317069  0.224548 -1.452698
2019-06-21  0.068410 -1.068250 -0.497162  1.430365
2019-06-22 -1.566644 -0.244240  0.703399 -0.126552
2019-06-23  0.364346 -1.587720  0.020569  0.192241
2019-06-24  0.740412  1.075560 -0.435956 -1.262316
2019-06-25  2.204695  1.474676 -1.677744  0.071725
2019-06-26  0.796055  0.136974 -0.921196 -1.636267
2019-06-27 -0.873244 -0.130625 -0.099243 -0.405046
2019-06-28 -0.407444  0.113449 -1.004773 -0.354557
2019-06-29  0.875133  0.114202 -0.479049 -0.390984
2019-06-30 -1.014393  0.783024 -0.683271  0.811564

In [60]:
tdf['2019-06-24':'2019-06-24']

                   A        B         C         D
2019-06-24  0.740412  1.07556 -0.435956 -1.262316

In [61]:
tdf['2019-06-24':] #2019-06-24 이후

                   A         B         C         D
2019-06-24  0.740412  1.075560 -0.435956 -1.262316
2019-06-25  2.204695  1.474676 -1.677744  0.071725
2019-06-26  0.796055  0.136974 -0.921196 -1.636267
2019-06-27 -0.873244 -0.130625 -0.099243 -0.405046
2019-06-28 -0.407444  0.113449 -1.004773 -0.354557
...              ...       ...       ...       ...
2019-09-23  0.520572  0.695328  0.262088  1.214833
2019-09-24  0.276925 -0.239720 -0.299392 -0.010030
2019-09-25 -0.180985  0.024840  0.872439  0.491288
2019-09-26 -0.100246  0.833274 -1.565180  0.011071
2019-09-27 -1.303524  0.089255  1.002013  0.136545

[96 rows x 4 columns]

In [62]:
tdf['C']

2017-01-01    1.610138
2017-01-02   -0.080417
2017-01-03   -1.521566
2017-01-04    0.420017
2017-01-05   -2.549659
                ...
2019-09-23    0.262088
2019-09-24   -0.299392
2019-09-25    0.872439
2019-09-26   -1.565180
2019-09-27    1.002013
Freq: D, Name: C, Length: 1000, dtype: float64

In [65]:
ts = pd.Series(np.random.randn(10),
               index=pd.DatetimeIndex(['2020-01-01', '2020-01-01', '2020-01-02', '2020-01-02', '2020-01-03',
                                       '2020-01-04', '2020-01-05', '2020-01-05', '2020-01-06', '2020-01-07']))
ts

2020-01-01    0.255240
2020-01-01   -0.085591
2020-01-02   -0.856667
2020-01-02   -0.709550
2020-01-03    1.711391
2020-01-04   -0.785601
2020-01-05    0.879293
2020-01-05   -0.197831
2020-01-06    0.727405
2020-01-07    0.790492
dtype: float64

In [69]:
ts.index.is_unique

False

In [71]:
ts['2020-01-01']

2020-01-01    0.255240
2020-01-01   -0.085591
dtype: float64

In [72]:
ts.groupby(level=0).mean()

2020-01-01    0.084824
2020-01-02   -0.783109
2020-01-03    1.711391
2020-01-04   -0.785601
2020-01-05    0.340731
2020-01-06    0.727405
2020-01-07    0.790492
dtype: float64

In [73]:
pd.date_range('2020-01-01', '2020-07-01')

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2020-06-22', '2020-06-23', '2020-06-24', '2020-06-25',
               '2020-06-26', '2020-06-27', '2020-06-28', '2020-06-29',
               '2020-06-30', '2020-07-01'],
              dtype='datetime64[ns]', length=183, freq='D')

In [74]:
pd.date_range(start='2020-01-01', periods=10)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10'],
              dtype='datetime64[ns]', freq='D')

In [75]:
pd.date_range(end='2020-07-01', periods=10) #07/01 앞으로 10개

DatetimeIndex(['2020-06-22', '2020-06-23', '2020-06-24', '2020-06-25',
               '2020-06-26', '2020-06-27', '2020-06-28', '2020-06-29',
               '2020-06-30', '2020-07-01'],
              dtype='datetime64[ns]', freq='D')

In [76]:
pd.date_range('2020-07-01', '2020-07-07', freq='B')  #business day만 출력하고 있음

DatetimeIndex(['2020-07-01', '2020-07-02', '2020-07-03', '2020-07-06',
               '2020-07-07'],
              dtype='datetime64[ns]', freq='B')

### 주기와 오프셋
|코드|오프셋|설명|
|---|---|---|
|D|Day|달력상 일|
|B|BusinessDay|영업일|
|W-MON, W-TUF, ...|Week|주|
|WON-MON, WON-2MON, ...|WeekOfMonth|월별 주차와 요일|
|MS|MonthBegin|일 시작일|
|BMS|BusinessMonthBegin|영업일 기준 월 시작일|
|M|MonthEnd|월 마지막일|
|BM|BusinessMonthEnd|영업일 기준 월 마지막일|
|QS-JAN, QS-FEB,...|QuarterBegin|분기 시작|
|BQS-JAN, BQS-FEB,...|BusinessQuarterBegin|영업일 기준 분기 시작|
|Q-JAN, Q-FEB,...|QuarterEnd|분기 마지막|
|BQ-JAN, BQ-FEB,...|BusinessQuarterEnd|영업일 기준 분기 마지막|
|AS-JAN, AS-FEB,...|YearBegin|연초|
|BAS-JAN, BAS-FEB,...|BusinessYearBegin|영업일 기준 연초|
|A-JAN, A-FEB,...|YearEnd|연말|
|BA-JAN, BA-FEB,...|BusinessYearEnd|영업일 기준 연말|
|H|Hour|시간|
|BH|BusinessHour|영업 시간|
|T 또는 min|Minute|분|
|S|Second|초|
|L 또는 ms|Milli|밀리초|
|U|Micro|마이크로초|
|N|Nano|나노초|

In [77]:
pd.timedelta_range(0, periods=12, freq='H')

TimedeltaIndex(['0 days 00:00:00', '0 days 01:00:00', '0 days 02:00:00',
                '0 days 03:00:00', '0 days 04:00:00', '0 days 05:00:00',
                '0 days 06:00:00', '0 days 07:00:00', '0 days 08:00:00',
                '0 days 09:00:00', '0 days 10:00:00', '0 days 11:00:00'],
               dtype='timedelta64[ns]', freq='H')

In [78]:
pd.timedelta_range(0, periods=60, freq='T')

TimedeltaIndex(['0 days 00:00:00', '0 days 00:01:00', '0 days 00:02:00',
                '0 days 00:03:00', '0 days 00:04:00', '0 days 00:05:00',
                '0 days 00:06:00', '0 days 00:07:00', '0 days 00:08:00',
                '0 days 00:09:00', '0 days 00:10:00', '0 days 00:11:00',
                '0 days 00:12:00', '0 days 00:13:00', '0 days 00:14:00',
                '0 days 00:15:00', '0 days 00:16:00', '0 days 00:17:00',
                '0 days 00:18:00', '0 days 00:19:00', '0 days 00:20:00',
                '0 days 00:21:00', '0 days 00:22:00', '0 days 00:23:00',
                '0 days 00:24:00', '0 days 00:25:00', '0 days 00:26:00',
                '0 days 00:27:00', '0 days 00:28:00', '0 days 00:29:00',
                '0 days 00:30:00', '0 days 00:31:00', '0 days 00:32:00',
                '0 days 00:33:00', '0 days 00:34:00', '0 days 00:35:00',
                '0 days 00:36:00', '0 days 00:37:00', '0 days 00:38:00',
                '0 days 00:39:00', '0 days 00:40:00', '0 days 00:41:00',
                '0 days 00:42:00', '0 days 00:43:00', '0 days 00:44:00',
                '0 days 00:45:00', '0 days 00:46:00', '0 days 00:47:00',
                '0 days 00:48:00', '0 days 00:49:00', '0 days 00:50:00',
                '0 days 00:51:00', '0 days 00:52:00', '0 days 00:53:00',
                '0 days 00:54:00', '0 days 00:55:00', '0 days 00:56:00',
                '0 days 00:57:00', '0 days 00:58:00', '0 days 00:59:00'],
               dtype='timedelta64[ns]', freq='T')

In [79]:
pd.timedelta_range(0, periods=10, freq='1H30T')

TimedeltaIndex(['0 days 00:00:00', '0 days 01:30:00', '0 days 03:00:00',
                '0 days 04:30:00', '0 days 06:00:00', '0 days 07:30:00',
                '0 days 09:00:00', '0 days 10:30:00', '0 days 12:00:00',
                '0 days 13:30:00'],
               dtype='timedelta64[ns]', freq='90T')

In [80]:
pd.date_range('2020-01-01', periods=20, freq='B') #가능한 영업일 출력

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-06',
               '2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-20', '2020-01-21', '2020-01-22',
               '2020-01-23', '2020-01-24', '2020-01-27', '2020-01-28'],
              dtype='datetime64[ns]', freq='B')

In [81]:
pd.date_range('2020-01-01', periods=30, freq='2H')

DatetimeIndex(['2020-01-01 00:00:00', '2020-01-01 02:00:00',
               '2020-01-01 04:00:00', '2020-01-01 06:00:00',
               '2020-01-01 08:00:00', '2020-01-01 10:00:00',
               '2020-01-01 12:00:00', '2020-01-01 14:00:00',
               '2020-01-01 16:00:00', '2020-01-01 18:00:00',
               '2020-01-01 20:00:00', '2020-01-01 22:00:00',
               '2020-01-02 00:00:00', '2020-01-02 02:00:00',
               '2020-01-02 04:00:00', '2020-01-02 06:00:00',
               '2020-01-02 08:00:00', '2020-01-02 10:00:00',
               '2020-01-02 12:00:00', '2020-01-02 14:00:00',
               '2020-01-02 16:00:00', '2020-01-02 18:00:00',
               '2020-01-02 20:00:00', '2020-01-02 22:00:00',
               '2020-01-03 00:00:00', '2020-01-03 02:00:00',
               '2020-01-03 04:00:00', '2020-01-03 06:00:00',
               '2020-01-03 08:00:00', '2020-01-03 10:00:00'],
              dtype='datetime64[ns]', freq='2H')

In [82]:
pd.date_range('2020-01-01', periods=20, freq='S')

DatetimeIndex(['2020-01-01 00:00:00', '2020-01-01 00:00:01',
               '2020-01-01 00:00:02', '2020-01-01 00:00:03',
               '2020-01-01 00:00:04', '2020-01-01 00:00:05',
               '2020-01-01 00:00:06', '2020-01-01 00:00:07',
               '2020-01-01 00:00:08', '2020-01-01 00:00:09',
               '2020-01-01 00:00:10', '2020-01-01 00:00:11',
               '2020-01-01 00:00:12', '2020-01-01 00:00:13',
               '2020-01-01 00:00:14', '2020-01-01 00:00:15',
               '2020-01-01 00:00:16', '2020-01-01 00:00:17',
               '2020-01-01 00:00:18', '2020-01-01 00:00:19'],
              dtype='datetime64[ns]', freq='S')

### 시프트(Shift)

In [84]:
ts = pd.Series(np.random.randn(5),
               index=pd.date_range('2020-01-01', periods=5, freq='B'))
ts

2020-01-01    0.106924
2020-01-02   -0.157456
2020-01-03    0.000677
2020-01-06   -1.295729
2020-01-07    0.492994
Freq: B, dtype: float64

In [85]:
ts.shift(1)

2020-01-01         NaN
2020-01-02    0.106924
2020-01-03   -0.157456
2020-01-06    0.000677
2020-01-07   -1.295729
Freq: B, dtype: float64

In [86]:
ts.shift(3)

2020-01-01         NaN
2020-01-02         NaN
2020-01-03         NaN
2020-01-06    0.106924
2020-01-07   -0.157456
Freq: B, dtype: float64

In [87]:
ts.shift(-2)

2020-01-01    0.000677
2020-01-02   -1.295729
2020-01-03    0.492994
2020-01-06         NaN
2020-01-07         NaN
Freq: B, dtype: float64

In [88]:
ts.shift(3, freq='B')

2020-01-06    0.106924
2020-01-07   -0.157456
2020-01-08    0.000677
2020-01-09   -1.295729
2020-01-10    0.492994
Freq: B, dtype: float64

In [89]:
ts.shift(2, freq='W')

2020-01-12    0.106924
2020-01-12   -0.157456
2020-01-12    0.000677
2020-01-19   -1.295729
2020-01-19    0.492994
dtype: float64

### 시간대 처리

* 국제표준시(Coordinated Universal Time, UTC)를 기준으로 떨어진 거리만큼 오프셋으로 시간대 처리
* 전 세계의 시간대 정보를 모아놓은 올슨 데이터베이스를 활용한 라이브러리인 `pytz` 사용

In [91]:
import pytz
pytz.common_timezones

['Africa/Abidjan', 'Africa/Accra', 'Africa/Addis_Ababa', 'Africa/Algiers', 'Africa/Asmara', 'Africa/Bamako', 'Africa/Bangui', 'Africa/Banjul', 'Africa/Bissau', 'Africa/Blantyre', 'Africa/Brazzaville', 'Africa/Bujumbura', 'Africa/Cairo', 'Africa/Casablanca', 'Africa/Ceuta', 'Africa/Conakry', 'Africa/Dakar', 'Africa/Dar_es_Salaam', 'Africa/Djibouti', 'Africa/Douala', 'Africa/El_Aaiun', 'Africa/Freetown', 'Africa/Gaborone', 'Africa/Harare', 'Africa/Johannesburg', 'Africa/Juba', 'Africa/Kampala', 'Africa/Khartoum', 'Africa/Kigali', 'Africa/Kinshasa', 'Africa/Lagos', 'Africa/Libreville', 'Africa/Lome', 'Africa/Luanda', 'Africa/Lubumbashi', 'Africa/Lusaka', 'Africa/Malabo', 'Africa/Maputo', 'Africa/Maseru', 'Africa/Mbabane', 'Africa/Mogadishu', 'Africa/Monrovia', 'Africa/Nairobi', 'Africa/Ndjamena', 'Africa/Niamey', 'Africa/Nouakchott', 'Africa/Ouagadougou', 'Africa/Porto-Novo', 'Africa/Sao_Tome', 'Africa/Tripoli', 'Africa/Tunis', 'Africa/Windhoek', 'America/Adak', 'America/Anchorage', 'America/Anguilla', 'America/Antigua', 'America/Araguaina', 'America/Argentina/Buenos_Aires', 'America/Argentina/Catamarca', 'America/Argentina/Cordoba', 'America/Argentina/Jujuy', 'America/Argentina/La_Rioja', 'America/Argentina/Mendoza', 'America/Argentina/Rio_Gallegos', 'America/Argentina/Salta', 'America/Argentina/San_Juan', 'America/Argentina/San_Luis', 'America/Argentina/Tucuman', 'America/Argentina/Ushuaia', 'America/Aruba', 'America/Asuncion', 'America/Atikokan', 'America/Bahia', 'America/Bahia_Banderas', 'America/Barbados', 'America/Belem', 'America/Belize', 'America/Blanc-Sablon', 'America/Boa_Vista', 'America/Bogota', 'America/Boise', 'America/Cambridge_Bay', 'America/Campo_Grande', 'America/Cancun', 'America/Caracas', 'America/Cayenne', 'America/Cayman', 'America/Chicago', 'America/Chihuahua', 'America/Costa_Rica', 'America/Creston', 'America/Cuiaba', 'America/Curacao', 'America/Danmarkshavn', 'America/Dawson', 'America/Dawson_Creek', 'America/Denver', 'America/Detroit', 'America/Dominica', 'America/Edmonton', 'America/Eirunepe', 'America/El_Salvador', 'America/Fort_Nelson', 'America/Fortaleza', 'America/Glace_Bay', 'America/Godthab', 'America/Goose_Bay', 'America/Grand_Turk', 'America/Grenada', 'America/Guadeloupe', 'America/Guatemala', 'America/Guayaquil', 'America/Guyana', 'America/Halifax', 'America/Havana', 'America/Hermosillo', 'America/Indiana/Indianapolis', 'America/Indiana/Knox', 'America/Indiana/Marengo', 'America/Indiana/Petersburg', 'America/Indiana/Tell_City', 'America/Indiana/Vevay', 'America/Indiana/Vincennes', 'America/Indiana/Winamac', 'America/Inuvik', 'America/Iqaluit', 'America/Jamaica', 'America/Juneau', 'America/Kentucky/Louisville', 'America/Kentucky/Monticello', 'America/Kralendijk', 'America/La_Paz', 'America/Lima', 'America/Los_Angeles', 'America/Lower_Princes', 'America/Maceio', 'America/Managua', 'America/Manaus', 'America/Marigot', 'America/Martinique', 'America/Matamoros', 'America/Mazatlan', 'America/Menominee', 'America/Merida', 'America/Metlakatla', 'America/Mexico_City', 'America/Miquelon', 'America/Moncton', 'America/Monterrey', 'America/Montevideo', 'America/Montserrat', 'America/Nassau', 'America/New_York', 'America/Nipigon', 'America/Nome', 'America/Noronha', 'America/North_Dakota/Beulah', 'America/North_Dakota/Center', 'America/North_Dakota/New_Salem', 'America/Ojinaga', 'America/Panama', 'America/Pangnirtung', 'America/Paramaribo', 'America/Phoenix', 'America/Port-au-Prince', 'America/Port_of_Spain', 'America/Porto_Velho', 'America/Puerto_Rico', 'America/Punta_Arenas', 'America/Rainy_River', 'America/Rankin_Inlet', 'America/Recife', 'America/Regina', 'America/Resolute', 'America/Rio_Branco', 'America/Santarem', 'America/Santiago', 'America/Santo_Domingo', 'America/Sao_Paulo', 'America/Scoresbysund', 'America/Sitka', 'America/St_Barthelemy', 'America/St_Johns', 'America/St_Kitts', 'America/St_Lucia', 'America/St_Thomas', 'America/St_Vincent', 'America/Swift_Current', 'America/Tegucigalpa', 'America/Thule', 'America/Thunder_Bay', 'America/Tijuana', 'America/Toronto', 'America/Tortola', 'America/Vancouver', 'America/Whitehorse', 'America/Winnipeg', 'America/Yakutat', 'America/Yellowknife', 'Antarctica/Casey', 'Antarctica/Davis', 'Antarctica/DumontDUrville', 'Antarctica/Macquarie', 'Antarctica/Mawson', 'Antarctica/McMurdo', 'Antarctica/Palmer', 'Antarctica/Rothera', 'Antarctica/Syowa', 'Antarctica/Troll', 'Antarctica/Vostok', 'Arctic/Longyearbyen', 'Asia/Aden', 'Asia/Almaty', 'Asia/Amman', 'Asia/Anadyr', 'Asia/Aqtau', 'Asia/Aqtobe', 'Asia/Ashgabat', 'Asia/Atyrau', 'Asia/Baghdad', 'Asia/Bahrain', 'Asia/Baku', 'Asia/Bangkok', 'Asia/Barnaul', 'Asia/Beirut', 'Asia/Bishkek', 'Asia/Brunei', 'Asia/Chita', 'Asia/Choibalsan', 'Asia/Colombo', 'Asia/Damascus', 'Asia/Dhaka', 'Asia/Dili', 'Asia/Dubai', 'Asia/Dushanbe', 'Asia/Famagusta', 'Asia/Gaza', 'Asia/Hebron', 'Asia/Ho_Chi_Minh', 'Asia/Hong_Kong', 'Asia/Hovd', 'Asia/Irkutsk', 'Asia/Jakarta', 'Asia/Jayapura', 'Asia/Jerusalem', 'Asia/Kabul', 'Asia/Kamchatka', 'Asia/Karachi', 'Asia/Kathmandu', 'Asia/Khandyga', 'Asia/Kolkata', 'Asia/Krasnoyarsk', 'Asia/Kuala_Lumpur', 'Asia/Kuching', 'Asia/Kuwait', 'Asia/Macau', 'Asia/Magadan', 'Asia/Makassar', 'Asia/Manila', 'Asia/Muscat', 'Asia/Nicosia', 'Asia/Novokuznetsk', 'Asia/Novosibirsk', 'Asia/Omsk', 'Asia/Oral', 'Asia/Phnom_Penh', 'Asia/Pontianak', 'Asia/Pyongyang', 'Asia/Qatar', 'Asia/Qostanay', 'Asia/Qyzylorda', 'Asia/Riyadh', 'Asia/Sakhalin', 'Asia/Samarkand', 'Asia/Seoul', 'Asia/Shanghai', 'Asia/Singapore', 'Asia/Srednekolymsk', 'Asia/Taipei', 'Asia/Tashkent', 'Asia/Tbilisi', 'Asia/Tehran', 'Asia/Thimphu', 'Asia/Tokyo', 'Asia/Tomsk', 'Asia/Ulaanbaatar', 'Asia/Urumqi', 'Asia/Ust-Nera', 'Asia/Vientiane', 'Asia/Vladivostok', 'Asia/Yakutsk', 'Asia/Yangon', 'Asia/Yekaterinburg', 'Asia/Yerevan', 'Atlantic/Azores', 'Atlantic/Bermuda', 'Atlantic/Canary', 'Atlantic/Cape_Verde', 'Atlantic/Faroe', 'Atlantic/Madeira', 'Atlantic/Reykjavik', 'Atlantic/South_Georgia', 'Atlantic/St_Helena', 'Atlantic/Stanley', 'Australia/Adelaide', 'Australia/Brisbane', 'Australia/Broken_Hill', 'Australia/Currie', 'Australia/Darwin', 'Australia/Eucla', 'Australia/Hobart', 'Australia/Lindeman', 'Australia/Lord_Howe', 'Australia/Melbourne', 'Australia/Perth', 'Australia/Sydney', 'Canada/Atlantic', 'Canada/Central', 'Canada/Eastern', 'Canada/Mountain', 'Canada/Newfoundland', 'Canada/Pacific', 'Europe/Amsterdam', 'Europe/Andorra', 'Europe/Astrakhan', 'Europe/Athens', 'Europe/Belgrade', 'Europe/Berlin', 'Europe/Bratislava', 'Europe/Brussels', 'Europe/Bucharest', 'Europe/Budapest', 'Europe/Busingen', 'Europe/Chisinau', 'Europe/Copenhagen', 'Europe/Dublin', 'Europe/Gibraltar', 'Europe/Guernsey', 'Europe/Helsinki', 'Europe/Isle_of_Man', 'Europe/Istanbul', 'Europe/Jersey', 'Europe/Kaliningrad', 'Europe/Kiev', 'Europe/Kirov', 'Europe/Lisbon', 'Europe/Ljubljana', 'Europe/London', 'Europe/Luxembourg', 'Europe/Madrid', 'Europe/Malta', 'Europe/Mariehamn', 'Europe/Minsk', 'Europe/Monaco', 'Europe/Moscow', 'Europe/Oslo', 'Europe/Paris', 'Europe/Podgorica', 'Europe/Prague', 'Europe/Riga', 'Europe/Rome', 'Europe/Samara', 'Europe/San_Marino', 'Europe/Sarajevo', 'Europe/Saratov', 'Europe/Simferopol', 'Europe/Skopje', 'Europe/Sofia', 'Europe/Stockholm', 'Europe/Tallinn', 'Europe/Tirane', 'Europe/Ulyanovsk', 'Europe/Uzhgorod', 'Europe/Vaduz', 'Europe/Vatican', 'Europe/Vienna', 'Europe/Vilnius', 'Europe/Volgograd', 'Europe/Warsaw', 'Europe/Zagreb', 'Europe/Zaporozhye', 'Europe/Zurich', 'GMT', 'Indian/Antananarivo', 'Indian/Chagos', 'Indian/Christmas', 'Indian/Cocos', 'Indian/Comoro', 'Indian/Kerguelen', 'Indian/Mahe', 'Indian/Maldives', 'Indian/Mauritius', 'Indian/Mayotte', 'Indian/Reunion', 'Pacific/Apia', 'Pacific/Auckland', 'Pacific/Bougainville', 'Pacific/Chatham', 'Pacific/Chuuk', 'Pacific/Easter', 'Pacific/Efate', 'Pacific/Enderbury', 'Pacific/Fakaofo', 'Pacific/Fiji', 'Pacific/Funafuti', 'Pacific/Galapagos', 'Pacific/Gambier', 'Pacific/Guadalcanal', 'Pacific/Guam', 'Pacific/Honolulu', 'Pacific/Kiritimati', 'Pacific/Kosrae', 'Pacific/Kwajalein', 'Pacific/Majuro', 'Pacific/Marquesas', 'Pacific/Midway', 'Pacific/Nauru', 'Pacific/Niue', 'Pacific/Norfolk', 'Pacific/Noumea', 'Pacific/Pago_Pago', 'Pacific/Palau', 'Pacific/Pitcairn', 'Pacific/Pohnpei', 'Pacific/Port_Moresby', 'Pacific/Rarotonga', 'Pacific/Saipan', 'Pacific/Tahiti', 'Pacific/Tarawa', 'Pacific/Tongatapu', 'Pacific/Wake', 'Pacific/Wallis', 'US/Alaska', 'US/Arizona', 'US/Central', 'US/Eastern', 'US/Hawaii', 'US/Mountain', 'US/Pacific', 'UTC']

In [93]:
tz = pytz.timezone('Asia/Seoul')
tz

In [96]:
dinx = pd.date_range('2020-01-01 09:00', periods=7, freq='B')
ts = pd.Series(np.random.randn(len(dinx)), index=dinx)
ts

2020-01-01 09:00:00   -0.461237
2020-01-02 09:00:00   -1.092831
2020-01-03 09:00:00    1.118771
2020-01-06 09:00:00   -1.088364
2020-01-07 09:00:00   -0.698250
2020-01-08 09:00:00   -0.833617
2020-01-09 09:00:00    0.133986
Freq: B, dtype: float64

In [97]:
pd.date_range('2020-01-01 09:00', periods=7, freq='B', tz='UTC')

DatetimeIndex(['2020-01-01 09:00:00+00:00', '2020-01-02 09:00:00+00:00',
               '2020-01-03 09:00:00+00:00', '2020-01-06 09:00:00+00:00',
               '2020-01-07 09:00:00+00:00', '2020-01-08 09:00:00+00:00',
               '2020-01-09 09:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='B')

In [105]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2020-01-01 09:00:00+00:00   -0.461237
2020-01-02 09:00:00+00:00   -1.092831
2020-01-03 09:00:00+00:00    1.118771
2020-01-06 09:00:00+00:00   -1.088364
2020-01-07 09:00:00+00:00   -0.698250
2020-01-08 09:00:00+00:00   -0.833617
2020-01-09 09:00:00+00:00    0.133986
Freq: B, dtype: float64

In [106]:
ts_utc.index

DatetimeIndex(['2020-01-01 09:00:00+00:00', '2020-01-02 09:00:00+00:00',
               '2020-01-03 09:00:00+00:00', '2020-01-06 09:00:00+00:00',
               '2020-01-07 09:00:00+00:00', '2020-01-08 09:00:00+00:00',
               '2020-01-09 09:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='B')

In [107]:
ts_utc.index

DatetimeIndex(['2020-01-01 09:00:00+00:00', '2020-01-02 09:00:00+00:00',
               '2020-01-03 09:00:00+00:00', '2020-01-06 09:00:00+00:00',
               '2020-01-07 09:00:00+00:00', '2020-01-08 09:00:00+00:00',
               '2020-01-09 09:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='B')

In [108]:
ts_utc.tz_convert('Asia/Seoul')

2020-01-01 18:00:00+09:00   -0.461237
2020-01-02 18:00:00+09:00   -1.092831
2020-01-03 18:00:00+09:00    1.118771
2020-01-06 18:00:00+09:00   -1.088364
2020-01-07 18:00:00+09:00   -0.698250
2020-01-08 18:00:00+09:00   -0.833617
2020-01-09 18:00:00+09:00    0.133986
Freq: B, dtype: float64

In [109]:
ts_seoul = ts.tz_localize('Asia/Seoul')
ts_seoul

2020-01-01 09:00:00+09:00   -0.461237
2020-01-02 09:00:00+09:00   -1.092831
2020-01-03 09:00:00+09:00    1.118771
2020-01-06 09:00:00+09:00   -1.088364
2020-01-07 09:00:00+09:00   -0.698250
2020-01-08 09:00:00+09:00   -0.833617
2020-01-09 09:00:00+09:00    0.133986
dtype: float64

In [110]:
ts_seoul.tz_convert('UTC')
ts_seoul

2020-01-01 09:00:00+09:00   -0.461237
2020-01-02 09:00:00+09:00   -1.092831
2020-01-03 09:00:00+09:00    1.118771
2020-01-06 09:00:00+09:00   -1.088364
2020-01-07 09:00:00+09:00   -0.698250
2020-01-08 09:00:00+09:00   -0.833617
2020-01-09 09:00:00+09:00    0.133986
dtype: float64

In [111]:
ts_seoul.tz_convert('Europe/Berlin')

2020-01-01 01:00:00+01:00   -0.461237
2020-01-02 01:00:00+01:00   -1.092831
2020-01-03 01:00:00+01:00    1.118771
2020-01-06 01:00:00+01:00   -1.088364
2020-01-07 01:00:00+01:00   -0.698250
2020-01-08 01:00:00+01:00   -0.833617
2020-01-09 01:00:00+01:00    0.133986
dtype: float64

In [112]:
ts.index.tz_localize('America/New_York')

DatetimeIndex(['2020-01-01 09:00:00-05:00', '2020-01-02 09:00:00-05:00',
               '2020-01-03 09:00:00-05:00', '2020-01-06 09:00:00-05:00',
               '2020-01-07 09:00:00-05:00', '2020-01-08 09:00:00-05:00',
               '2020-01-09 09:00:00-05:00'],
              dtype='datetime64[ns, America/New_York]', freq=None)

In [114]:
stamp = pd.Timestamp('2020-01-01 12:00')
stamp_utc = stamp.tz_localize('UTC')
stamp_utc

Timestamp('2020-01-01 12:00:00+0000', tz='UTC')

In [115]:
stamp_utc.value

1577880000000000000

In [116]:
stamp_utc.tz_convert('Asia/Seoul')

Timestamp('2020-01-01 21:00:00+0900', tz='Asia/Seoul')

In [117]:
stamp_utc.tz_convert('Asia/Seoul').value

1577880000000000000

In [120]:
stamp_ny = pd.Timestamp('2020-01-01 12:00', tz='America/New_York')
stamp_ny

Timestamp('2020-01-01 12:00:00-0500', tz='America/New_York')

In [121]:
stamp_utc.value

1577880000000000000

In [122]:
stamp_ny.value

1577898000000000000

In [123]:
stamp_utc.tz_convert('Asia/Shanghai')

Timestamp('2020-01-01 20:00:00+0800', tz='Asia/Shanghai')

In [125]:
  stamp = pd.Timestamp('2020-01-01 12:00', tz='Asia/Seoul')
  stamp

Timestamp('2020-01-01 12:00:00+0900', tz='Asia/Seoul')

In [131]:
from pandas.tseries.offsets import Hour
stamp + Hour()

Timestamp('2020-01-01 14:00:00+0900', tz='Asia/Seoul')

In [133]:
stamp + Hour(3)

Timestamp('2020-01-01 15:00:00+0900', tz='Asia/Seoul')

In [132]:
stamp + 3 * Hour()

Timestamp('2020-01-01 15:00:00+0900', tz='Asia/Seoul')

In [134]:
ts_utc

2020-01-01 09:00:00+00:00   -0.461237
2020-01-02 09:00:00+00:00   -1.092831
2020-01-03 09:00:00+00:00    1.118771
2020-01-06 09:00:00+00:00   -1.088364
2020-01-07 09:00:00+00:00   -0.698250
2020-01-08 09:00:00+00:00   -0.833617
2020-01-09 09:00:00+00:00    0.133986
Freq: B, dtype: float64

In [139]:
ts1 = ts_utc[:5].tz_convert('Europe/Berlin')
ts2 = ts_utc[2:].tz_convert('America/New_York')

ts = ts1 + ts2
ts

2020-01-01 09:00:00+00:00         NaN
2020-01-02 09:00:00+00:00         NaN
2020-01-03 09:00:00+00:00    2.237541
2020-01-06 09:00:00+00:00   -2.176727
2020-01-07 09:00:00+00:00   -1.396501
2020-01-08 09:00:00+00:00         NaN
2020-01-09 09:00:00+00:00         NaN
Freq: B, dtype: float64

In [141]:
ts.index #결국 UTC로 변환해서 계산한 것임

DatetimeIndex(['2020-01-01 09:00:00+00:00', '2020-01-02 09:00:00+00:00',
               '2020-01-03 09:00:00+00:00', '2020-01-06 09:00:00+00:00',
               '2020-01-07 09:00:00+00:00', '2020-01-08 09:00:00+00:00',
               '2020-01-09 09:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='B')

### 기간과 기간 연산

In [142]:
p = pd.Period(2020, freq='A-JAN')
p

Period('2020', 'A-JAN')

In [143]:
p + 2

NameError: ignored

In [144]:
p - 3

Period('2017', 'A-JAN')

In [145]:
p1 = pd.Period(2010, freq='A-JAN')
p2 = pd.Period(2020, freq='A-JAN')
p2 - p1

In [146]:
pr = pd.period_range('2020-01-01', '2020-06-30', freq='M')
pr

PeriodIndex(['2020-01', '2020-02', '2020-03', '2020-04', '2020-05', '2020-06'], dtype='period[M]', freq='M')

In [147]:
pd.Series(np.random.randn(6), index=pr)

2020-01   -2.317956
2020-02    0.020762
2020-03    2.951420
2020-04    1.253591
2020-05   -0.086172
2020-06   -3.007431
Freq: M, dtype: float64

In [148]:
pidx = pd.PeriodIndex(['2020-01', '2020-02', '2020-04'], freq='M')
pidx

PeriodIndex(['2020-01', '2020-02', '2020-04'], dtype='period[M]', freq='M')

In [149]:
p = pd.Period('2020', freq='A-FEB')
p

Period('2020', 'A-FEB')

In [150]:
p.asfreq('M', how='start')

Period('2019-03', 'M')

In [151]:
p.asfreq('M', how='end')

Period('2020-02', 'M')

In [153]:
p = pd.Period('2020', freq='A-OCT')
p

Period('2020', 'A-OCT')

In [154]:
p.asfreq('M', how='start')

Period('2019-11', 'M')

In [155]:
p.asfreq('M', how='end')

Period('2020-10', 'M')

In [156]:
pr = pd.period_range('2010', '2020', freq='A-JAN')
ts = pd.Series(np.random.randn(len(pr)), index=pr)
ts

2010   -1.407867
2011    0.947663
2012   -0.817917
2013    1.787285
2014   -0.355744
2015    0.268652
2016    1.234882
2017    1.385979
2018   -0.245785
2019    0.619145
2020    0.528920
Freq: A-JAN, dtype: float64

In [157]:
ts.asfreq('M', how='start') #JAN으로 해두어서 시작은 2월

2009-02   -1.407867
2010-02    0.947663
2011-02   -0.817917
2012-02    1.787285
2013-02   -0.355744
2014-02    0.268652
2015-02    1.234882
2016-02    1.385979
2017-02   -0.245785
2018-02    0.619145
2019-02    0.528920
Freq: M, dtype: float64

In [158]:
ts.asfreq('M', how='end')

2010-01   -1.407867
2011-01    0.947663
2012-01   -0.817917
2013-01    1.787285
2014-01   -0.355744
2015-01    0.268652
2016-01    1.234882
2017-01    1.385979
2018-01   -0.245785
2019-01    0.619145
2020-01    0.528920
Freq: M, dtype: float64

In [159]:
ts.asfreq('B', how='end') #비지니스데이의 마지막월의 마지막일

2010-01-29   -1.407867
2011-01-31    0.947663
2012-01-31   -0.817917
2013-01-31    1.787285
2014-01-31   -0.355744
2015-01-30    0.268652
2016-01-29    1.234882
2017-01-31    1.385979
2018-01-31   -0.245785
2019-01-31    0.619145
2020-01-31    0.528920
Freq: B, dtype: float64

In [160]:
p = pd.Period('2020Q2', freq='Q-JAN')
p

Period('2020Q2', 'Q-JAN')

In [161]:
p.asfreq('D', 'start')

Period('2019-05-01', 'D')

In [162]:
p.asfreq('D', 'end')

Period('2019-07-31', 'D')

In [163]:
pr = pd.period_range('2019Q3', '2020Q3', freq='Q-JAN')
ts = pd.Series(np.arange(len(pr)), index=pr)
ts

2019Q3    0
2019Q4    1
2020Q1    2
2020Q2    3
2020Q3    4
Freq: Q-JAN, dtype: int64

In [166]:
pr = pd.date_range('2019-01', periods=5, freq='Q-JAN')
ts = pd.Series(np.arange(5), index=pr)
ts

2019-01-31    0
2019-04-30    1
2019-07-31    2
2019-10-31    3
2020-01-31    4
Freq: Q-JAN, dtype: int64

In [167]:
ts.to_period()

2019Q4    0
2020Q1    1
2020Q2    2
2020Q3    3
2020Q4    4
Freq: Q-JAN, dtype: int64

In [168]:
pr = pd.date_range('2020-01-01', periods=5, freq='D')
ts = pd.Series(np.random.randn(5), index=pr)
ts

2020-01-01    0.605599
2020-01-02    0.933045
2020-01-03    0.123316
2020-01-04   -0.765572
2020-01-05   -0.007851
Freq: D, dtype: float64

In [170]:
p = ts.to_period('M')
p

2020-01    0.605599
2020-01    0.933045
2020-01    0.123316
2020-01   -0.765572
2020-01   -0.007851
Freq: M, dtype: float64

In [171]:
p.to_timestamp(how='start')

2020-01-01    0.605599
2020-01-01    0.933045
2020-01-01    0.123316
2020-01-01   -0.765572
2020-01-01   -0.007851
dtype: float64

### 리샘플링(Resampling)

* 리샘플링(Resampling): 시계열의 빈도 변환
* 다운샘플링(Down sampling): 상위 빈도 데이터를 하위 빈도 데이터로 집계
* 업샘플링(Up sampling): 하위 빈도 데이터를 상위 빈도 데이터로 집계
* resample 메소드

|인자|설명|
|---|---|
|freq|리샘플링 빈도|
|axis|림샘플링 축(기본값 axis=0|
|fill_method|업샘플링시 보가 수행(None, ffill, bfill|
|closed|다운샘플링 시 각 간격의 포함 위치(right, left|
|label|다운샘플링 시 집계된 결과 라벨 결정(right, left|
|loffset|나뉜 그룹의 라벨을 맞추기 위한 오프셋|
|limit|보간법을 사용할 때 보간을 적용할 최대 기간|
|kind|기간(period) 또는 타임스탬프(timestamp) 집계 구분|
|convention|기간을 리샘플링할 때 하위 빈도 기간에서 상위 빈도로 변환 시 방식(start 또는 end)|

In [173]:
dr = pd.date_range('2020-01-01', periods=200, freq='D')
ts = pd.Series(np.random.randn(len(dr)), index=dr)
ts

2020-01-01   -0.949444
2020-01-02    0.810060
2020-01-03   -0.396555
2020-01-04   -0.827089
2020-01-05   -0.278001
                ...
2020-07-14   -1.213426
2020-07-15   -0.642954
2020-07-16   -0.061453
2020-07-17   -0.292057
2020-07-18   -0.233920
Freq: D, Length: 200, dtype: float64

In [174]:
ts.resample('M').mean() #기존 day 가 month로 집계됨

2020-01-31    0.138100
2020-02-29   -0.160120
2020-03-31   -0.386006
2020-04-30   -0.113985
2020-05-31   -0.276340
2020-06-30   -0.174092
2020-07-31   -0.312876
Freq: M, dtype: float64

In [176]:
ts.resample('M', kind='period').mean()

2020-01    0.138100
2020-02   -0.160120
2020-03   -0.386006
2020-04   -0.113985
2020-05   -0.276340
2020-06   -0.174092
2020-07   -0.312876
Freq: M, dtype: float64

In [178]:
dr = pd.date_range('2020-01-01', periods=10, freq='T') # 'T'니까 1분단위
ts = pd.Series(np.range(10), index=dr)
ts

AttributeError: ignored

### 무빙 윈도우(Moving Window)

## 데이터 읽기 및 저장

### 텍스트 파일 읽기/쓰기

### 이진 데이터 파일 읽기/쓰기

## 데이터 정제

### 누락값 처리

* 대부분의 실제 데이터들은 정제되지 않고 누락값들이 존재
* 서로 다른 데이터들은 다른 형태의 결측을 가짐
* 결측 데이터는 `null`, `NaN`, `NA`로 표기

#### None: 파이썬 누락 데이터

#### NaN: 누락된 수치 데이터

#### Null 값 처리

### 중복 제거

### 값 치환

## 참고문헌

* Pandas 사이트: https://pandas.pydata.org/
* Jake VanderPlas, "Python Data Science Handbook", O'Reilly
* Wes Mckinney, "Python for Data Analysis", O'Reilly